{"schedule":{"conference":{"title":"Connect.JS 2015","start":"2015-10-16","end":"2015-10-15","daysCount":3,"timeslot_duration":"00:10","days":[{"index":0,"date":"2015-10-15","day_start":"2015-10-15T08:00:00-04:00","day_end":"2015-10-15T20:00:00-04:00","rooms":{"115":[],"Room 113":[{"id":154,"date":"2015-10-15T09:00:00-04:00","start":"09:00","duration":"03:00","room":"Room 113","title":"Hacking Web Components and Polymer","track":"Workshop","type":"workshop","abstract":"Component-oriented UI development has been popular for over twenty years, with the introduction of Visual Basic. The promise is simple: packaged reusable code that makes powerful widgets like grids, toolbars, menus, smart input controls, panels, media players, charts, graphs, trees, image viewers, and so on, easy to integrate into applications.\r\n\r\nOn the web, frameworks such as ASP.NET, JSF, Tapestry, Wicket, GWT, and Vaadin take advantage of component architectures, and there is no shortage of JavaScript/HTML5 widget libraries such as YUI, KendoUI, jQuery UI, Bootstrap, ExtJS, and so on. Each of these frameworks allows developers to build their own custom components, but those components won’t work outside of the framework. Wouldn’t it be nice if there were a standard way to build a UI component that runs in a browser? A component model that is part of the open web?\r\n\r\nFinally, there is: Web Components, an emerging standard from the Web Applications Working Group (WAWG). Web Components consists of five different standards: Templates, Decorators,\r\nCustom Elements, Shadow DOM, and Imports. Together, these standards allow you to build custom widgets with HTML5, JavaScript, and CSS that can be used just like native HTML elements.\r\n\r\nSince the standards are not fully supported in all browsers, you need a library to support them in non-compliant browsers. Google’s Polymer does just this, and more.\r\n\r\nCome to this workshop to learn about these exciting new technologies hands-on.","persons":[{"id":160,"full_public_name":"Kito Mann","abstract":"Kito D. Mann is the Principal Consultant at Virtua, Inc., specializing in enterprise application architecture, training, development, and mentoring with JavaServer Faces, HTML5, portlets, Liferay, and Java EE technologies. He is also the editor-in-chief of JSFCentral.com (www.jsfcentral.com), co-host of the Enterprise Java Newscast (http://www.enterprisejavanews.com), host of the JSF Podcast interview series (http://www.jsfcentral.com/resources/jsfcentralpodcasts/), and the author of JavaServer Faces in Action (Manning). Mann has participated in several Java Community Process expert groups (including CDI, JSF and Portlets) and is also an internationally recognized speaker. He holds a BA in Computer Science from Johns Hopkins University.","twitter_name":"kito99","avatar_path":"/system/avatars/160/large/kito-mann-small.jpg?1438802820"}]}],"Room 106":[{"id":346,"date":"2015-10-15T09:00:00-04:00","start":"09:00","duration":"03:00","room":"Room 106","title":"Angular Workshop","track":"Workshop","type":"workshop","abstract":"Angular is a new JavaScript framework from Google. If you are looking into developing rich web applications, Angular is your friend. Angular embraces HTML and CSS, allowing you to extend HTML towards your application, and uses plain JavaScript which makes your code easy to reuse, and test. In this workshop we will start from the ground up, and build our way through a simple application that will let us explore the various constructs, and the familiarize ourselves with some of the new terminology in Angular.\r\n\r\nIn this workshop we will get down and dirty with Angular. In this workshop we will start with the very basics of how to boostrap our AngularJS application, and work slowly towards making REST-ful AJAX requests to a backend. List of topics include\r\n\r\nBootstrapping an AngularJS application using ng-app\r\nng-init and the evaluation {{ }} directive\r\nA brief look at $rootScope\r\nng-model\r\nControllers, Dependency Injection, and the View-Model ($scope)\r\nLooping using hg-repeat\r\nForms using ng-form, form validation and submission in AngularJS\r\nAngular provided filters and how to write our own\r\nFactories\r\nMaking AJAX requests using $http\r\nRouting and route params using $routeProvider and $routeParams\r\nIf time permits we will discuss a few good practices when working with AngularJS applications.\r\n\r\nThis is a hands on tutorial so bring your laptops!","persons":[{"id":115,"full_public_name":"Raju Gandhi","abstract":"I am a Software Craftsman with over a decade of experience building Web Applications and Enterprise Software and I love to build great software","twitter_name":"looselytyped","avatar_path":"/system/avatars/115/large/me2_400x400.png?1409064068"}]}],"Room 105":[{"id":318,"date":"2015-10-15T09:00:00-04:00","start":"09:00","duration":"03:00","room":"Room 105","title":"An Introduction to Node.js","track":"Workshop","type":"workshop","abstract":"Node.js is just JavaScript they said. All you need is basic JS skills they said. They were right! That said, as with any platform or framework there are many nuances to Node.js development that even experienced JavaScript developers need to learn. In this workshop we'll cover some of those details and put that JavaScript knowledge to work.","persons":[{"id":106,"full_public_name":"Jordan Kasper","abstract":"Shortly after it arrived at his home in 1993, Jordan began disassembling his first computer - his mother was not happy. She breathed more easily when he moved from hardware into programming. Jordan's experience includes large companies, startups, and universities. He contributes to a few open source projects and loves participating in user groups, barcamps, and hackathons. Jordan's primary mission is to use JavaScript, HTML, and CSS to elevate web applications above their desktop rivals. He currently works for appendTo, a leader in front-end software solutions. In his down time he enjoys puzzles of all sorts and board games.","twitter_name":"jakerella","avatar_path":"/system/avatars/106/large/jordan_bw.jpg?1437507769"}]}],"Room 104":[{"id":139,"date":"2015-10-15T09:00:00-04:00","start":"09:00","duration":"03:00","room":"Room 104","title":"Advanced JavaScript: Foundations","track":"Workshop","type":"workshop","abstract":"In this one-day intensive course, we will dive deep into core mechanisms of the JS language, probably more than you ever have before. Our goal is to not merely understand what these things do, but how and why. \r\n\r\nWe will cover: \r\n\r\n• nested lexical scope \r\n• hoisting \r\n• closures \r\n• modules \r\n• 'this' keyword \r\n• common oo patterns \r\n• object prototypes \r\n• delegation vs inheritance \r\n","persons":[{"id":145,"full_public_name":"Kyle Simpson","abstract":"Kyle Simpson is an Open Web Evangelist from Austin, TX, who's passionate about all things JavaScript. He's an author, workshop trainer, tech speaker, and OSS contributor/leader.","twitter_name":"getify","avatar_path":"/system/avatars/145/large/kylesimpson.png?1432088583"}]}],"Ballroom F":[],"Ballroom D":[],"Ballroom C":[],"Ballroom ABE":[],"Foyer":[{"id":367,"date":"2015-10-15T19:50:00-04:00","start":"19:50","duration":"00:10","room":"Foyer","title":"Welcome Reception (Jocks and Jills Grill at Cobb Galleria)","track":"Admin","type":"other","abstract":"Welcome Reception","persons":[{"id":7,"full_public_name":"Pratik Patel","abstract":"Pratik Patel is the CTO of Atlanta based startup TripLingo. He’s also an author, speaker, and consultant helping technologists build great apps, and business people make the most of technology. After many years in the big corporate world in places such as New York, London and Hong Long, he’s in the startup space now and hacks iOS, Android, Java, HTML5, CSS3, JavaScript, Rails, and ..... well everything except Perl. You can follow him on twitter at @prpatel.","twitter_name":"prpatel","avatar_path":"/system/avatars/7/large/profile-pic-09-11-2011.jpg?1406354223"}]}]}},{"index":1,"date":"2015-10-16","day_start":"2015-10-16T08:00:00-04:00","day_end":"2015-10-16T19:00:00-04:00","rooms":{"115":[{"id":266,"date":"2015-10-16T10:00:00-04:00","start":"10:00","duration":"01:00","room":"115","title":"Building Web Sites that Work Everywhere","track":"Web/HTML/CSS (D)","type":"lecture","abstract":"How to build web sites that work well across various browsers versions and devices is always challenging for web developers. In the session, you’ll learn the best practices and strategy to develop cross-browser web sites that will work with the existing and future browsers. Tools for interoperability tests, cross-browser fundamentals, and tips and tricks on HTML5, CSS, JavaScript development will be illustrated.  Browser detection, UA sniffing, CSS prefix, and fallbacks will all be examined in the session. A real life example will be used to demonstrate step by step how to build cross-browser and plug-in-Free experiences. With a couple of simple changes to your sites, you can take advantage of web standards and HTML5 features today without breaking your sites in the future. Expect a lot of demos and code in the session.","persons":[{"id":236,"full_public_name":"Dr. Doris Chen","abstract":"Doris is a Senior Technology Evangelist at Microsoft for the Western region of the United States, specialized in web technologies (HTML5, jQuery, JavaScript, Ajax, and Java).  \r\nDoris has over 18 years of experience in the software industry working in several open source web tier technologies, Java platform, .NET and distributed computing technologies. She has developed and delivered over 400 keynotes, technical sessions, and trainings worldwide. She speaks at numerous international conferences and user groups including O’Reilly OSCON, Fluent, Dev Nexus, HTML5 Dev Conference, WebVisions,  JavaOne, SD Forum, and worldwide User Groups. Doris works very closely to create and foster the open source community around Java, NetBeans, Glassfish, and related technologies. Before joining Microsoft, Doris Chen was a Technology Evangelist at Sun Microsystems.\r\nDoris received her Ph.D. from the University of California at Los Angeles (UCLA) in computer engineering, specializing in medical informatics. ","twitter_name":"@doristchen","avatar_path":"/system/avatars/236/large/Doris_pro.jpg?1435689363"}]},{"id":330,"date":"2015-10-16T11:00:00-04:00","start":"11:00","duration":"01:00","room":"115","title":"Re-evaluating Front-end Performance Best Practices","track":"Web/HTML/CSS (D)","type":"lecture","abstract":"Does caching object properties in for-loops really make your application faster? What about serving assets from multiple subdomains? Or using dynamic script insertion? In this talk, we revisit some common web performance best practices and discover how well they fare in 2015's browser and connectivity landscape. Spoiler alert: not well.","persons":[{"id":270,"full_public_name":"Ben Vinegar","abstract":"Ben Vinegar is a software engineer at Sentry, and the co-author of Third-party JavaScript. He lives and works in San Francisco.\r\n","twitter_name":"bentlegen","avatar_path":"/system/avatars/270/large/ben-avatar.jpg?1436822986"}]},{"id":161,"date":"2015-10-16T13:00:00-04:00","start":"13:00","duration":"01:00","room":"115","title":"They’re Back! Modern Tools for Static Site Development","track":"Web/HTML/CSS (D)","type":"lecture","abstract":"Static site engines (or generators) are incredibly powerful and popular tools for building web sites. However, there are currently almost 400 options available. In this session, we'll cover what types of sites static site engines are good for, the commonalities of all static site engines and then review several of the most popular options to compare features and differentiators.","persons":[{"id":23,"full_public_name":"Brian Rinaldi","abstract":"Brian Rinaldi is the Developer Content Manager at Telerik where he manages the Telerik Developer Connection. Brian is a frequent speaker and author. Brian founded the popular site Flippin' Awesome (now the Modern Web) and is co-editor of the Mobile Web Weekly newsletter.","twitter_name":"remotesynth","avatar_path":"/system/avatars/23/large/me_stlucia_sm2.jpg?1407108929"}]},{"id":324,"date":"2015-10-16T14:00:00-04:00","start":"14:00","duration":"01:00","room":"115","title":"Look Ma, No Framework!","track":"Web/HTML/CSS (D)","type":"lecture","abstract":"Over the course of 50 minutes we’ll be covering an introduction to game development and the HTML5 canvas element.  Through hands on code examples, we’ll be covering the basics of canvas manipulation by creating a JavaScript clone of the game Minesweeper.  By the end of this talk, you’ll understand the basics of the canvas element and how to manipulate it without the use of a game framework.","persons":[{"id":265,"full_public_name":"Sarah Frisk","abstract":"Sarah is a software developer, comic artist, Project Lead for jQuery Foundation’s Chassis project, and indie game dev enthusiast. She has two comics, Monster Markup Manual and Tavern Wenches.","twitter_name":"SarahFrisk","avatar_path":"/system/avatars/265/large/OJ9QZTXL.jpeg?1439314074"}]},{"id":168,"date":"2015-10-16T15:30:00-04:00","start":"15:30","duration":"01:00","room":"115","title":"CSS For Engineers","track":"Web/HTML/CSS (D)","type":"lecture","abstract":"If you think CSS is just for designers who tinker with pixels and colors, think again.  It takes both sides of your brain to write CSS.  If you are a left-brain thinker, come see why CSS is for you, too.","persons":[{"id":116,"full_public_name":"Keith J Grant","abstract":"I am a Senior Web Developer at Intercontinental Exchange, where, among other things, I wrote and maintain the CSS for The New York Stock Exchange. I am the author of the upcoming book CSS in Action.","twitter_name":"keithjgrant","avatar_path":"/system/avatars/116/large/avatar.jpg?1433426633"}]},{"id":349,"date":"2015-10-16T16:30:00-04:00","start":"16:30","duration":"00:30","room":"115","title":"Dolby Audio Comes to the Web","track":"Web/HTML/CSS (D)","type":"lecture","abstract":"With the latest Windows 10 offering that includes Microsoft Edge, Dolby Audio is now available for playback through the web. In this session, Eric Ang, Head of the Dolby Developer Program will demo and provide the steps for Dolby Digital Plus playback online. He will also show how to take a existing piece of content, encode it, include it, and feature detect for Dolby playback since not all browsers are alike.  Be sure to attend this session if you’re interested to hear the difference good audio can make in your web project.","persons":[{"id":287,"full_public_name":"Eric Ang","abstract":"Eric has been working with Developers for over 11 years, starting his career at Ericsson Inc. Most recently, he was at NOOK Media LLC. as the Developer Services & Technical Manager, helping to build and define their developer outreach program. Now as head of Dolby's Developer program, he's wants developers to start thinking how to make audio better for music, games, and interactive content.","twitter_name":"@angjc3","avatar_path":"/system/avatars/287/large/Ang.jpg?1439748534"}]}],"Room 113":[{"id":319,"date":"2015-10-16T10:00:00-04:00","start":"10:00","duration":"01:00","room":"Room 113","title":"Building Upworthy on Rails","track":"Ruby & Rails (113)","type":"lecture","abstract":"Launched three and a half years ago, Upworthy quickly became one of the most popular brands on the Web. It's one of the most highly-trafficked sites built on Ruby on Rails and hosted on Heroku. Hear the story of how Upworthy started out as a modest Sinatra app, then moved to a monolithic Rails app, and has now been broken up into a set of services powered by Rails and JavaScript. Technical decision-making in the midst of massive growth will be described in detail.","persons":[{"id":260,"full_public_name":"Luigi Ray-Montanez","abstract":"Luigi is the founding engineer at Upworthy, a viral media site that aims to drive massive amounts of attention to the topics that matter most. Before Upworthy, Luigi was a software developer at the Sunlight Foundation. He also co-organizes Code for Atlanta.","twitter_name":"1uigi","avatar_path":"/system/avatars/260/large/Upworthy_Portrait_Square.jpg?1438970452"}]},{"id":260,"date":"2015-10-16T11:00:00-04:00","start":"11:00","duration":"00:40","room":"Room 113","title":"Dynamically Sassy","track":"Ruby & Rails (113)","type":"lecture","abstract":"When we want to offer customizability to the users of our applications, things can get tricky. How do we allow users to customize the look of the user interface while reusing the static CSS we’ve already designed? There is a way, but it is fraught with many dangers. Learn about the power of dynamically generating CSS from Sass files in Rails. Tackle the foes of dynamic content injection, rendering, caching, and background processing. In the end, we will look triumphantly at our ability to reuse our application styles to create customizable interfaces for our end users.","persons":[{"id":129,"full_public_name":"Jeremy Fairbank","abstract":"Jeremy Fairbank is a remote web developer in Tennessee. He works for Push Agency with an entirely distributed team that creates amazing designs and software. He has worked on the front end and back end extensively with Angular, Backbone, Marionette, and Ruby on Rails. He blogs at <a href=\"http://blog.jeremyfairbank.com\">blog.jeremyfairbank.com</a> and has been featured on JSWeekly a few times. Outside of developing, he enjoys being a husband and father as well as playing guitar.","twitter_name":"@elpapapollo","avatar_path":"/system/avatars/129/large/bio-photo-1-600x600.jpg?1435679574"}]},{"id":332,"date":"2015-10-16T13:00:00-04:00","start":"13:00","duration":"01:00","room":"Room 113","title":"Video killed the Telephone Star","track":"Ruby & Rails (113)","type":"lecture","abstract":"When you want to talk to someone, where do you turn? Skype? Slack or HipChat? Maybe even an old-fashioned telephone? As great (or not) as these are, they all fail in one important way: Context.  As developers, why don’t we enable our users to communicate where they are doing everything else, right inside the browser or mobile app? The technology to create contextual communications is evolving quickly with exciting technologies like WebRTC. This talk is about how to use WebRTC with Rails to enhance almost any application with voice, video & text. We will cover some of the ways communications can be best employed, including design considerations, as well as available Open Source projects. We will feature a recently released Rails Engine called Talking Stick that makes adding WebRTC to any Rails app a snap.","persons":[{"id":272,"full_public_name":"Ben Klang","abstract":"Ben Klang is the founder of Mojo Lingo, an Atlanta-based consultancy specializing in real-time communications applications. He has been involved in Open Source for over 20 years, and is currently the lead of a Ruby-language (Rails-inspired) framework for communications apps called Adhearsion. A regular speaker at conferences, he enjoys surprising the audience by making telephones do unexpected things. Native to Atlanta, he lives there today with his wife and daughter.","twitter_name":"bklang","avatar_path":"/system/avatars/272/large/BenKlang3521RTP-Square.jpg?1436913433"}]},{"id":364,"date":"2015-10-16T14:00:00-04:00","start":"14:00","duration":"01:00","room":"Room 113","title":"Using Rails with AngularJS","track":"Ruby & Rails (113)","type":"lecture","abstract":"We'll take a look at how to configure a Rails API for your Javascript front-end framework.","persons":[{"id":293,"full_public_name":"Marc Wright","abstract":"Marc is a Ruby/Rails developer and Web Development Immersive instructor at General Assemb.ly.","twitter_name":"@MarcWright90291","avatar_path":"/system/avatars/293/large/marc.jpg?1441200104"}]},{"id":159,"date":"2015-10-16T15:30:00-04:00","start":"15:30","duration":"01:00","room":"Room 113","title":"Same Thing Happens Every Time","track":"General Computing","type":"lecture","abstract":"Patterns are not just for programs; we also see them in people and processes. In this presentation, we will explore patterns found in popular hero(ine) stories like Star Wars, Princess Bride, Tron, The Matrix, Star Trek,\u2028The Hunger Games, The Last Airbender, Harry Potter. We will then use those lessons to work through some patterns in the workplace, including the people you meet and the organizations they belong to, with an emphasis on how to work effectively with them.","persons":[{"id":158,"full_public_name":"Paul M. Jones","abstract":"Internationally-recognized PHP expert; <a href=\"http://php-fig.org\">PHP-FIG</a> founding member; primary author on PSR-1, PSR-2, and PSR-4; author of <a href=\"https://leanpub.com/mlaphp\">Modernizing Legacy Applications in PHP</a>; lead on the <a href=\"http://auraphp.com\">Aura</a> and <a href=\"https://github.com/radarphp/Radar.Project\">Radar</a> projects; defined the <a href=\"http://pmjones.io/adr\">Action-Domain-Responder</a> pattern.","twitter_name":"pmjones","avatar_path":"/system/avatars/158/large/IMG_3665-sq.jpg?1432761757"}]},{"id":363,"date":"2015-10-16T16:30:00-04:00","start":"16:30","duration":"01:00","room":"Room 113","title":"Refactoring Benefits and Tips","track":"Ruby & Rails (113)","type":"lecture","abstract":"<p>We're taught to \"always code as if the person who ends up maintaining your code is a violent psychopath who knows where you live,\" yet every dev has at least one horror story (pun intended). In this talk, I propose a new idea: think of yourself as a writer who has to read his own work six months from now. With this me-first mindset (and greedy motivation), we'll discuss the benefits of refactoring that will benefit #1 (aka you).</p>\r\n<p>We'll focus 80/20 on Ruby/JavaScript, but these principles will extend to any language/framework.</p>","persons":[{"id":292,"full_public_name":"Gerry Pass","abstract":"<p>Gerry is a former Sales Engineer with one of the largest companies in the world who made a career change into web development in May 2013. He is dedicated to continuous growth, clean and simple code, and teaching others about technology and development.</p>","twitter_name":"rgp4ss","avatar_path":"/system/avatars/292/large/gp.png?1441137117"}]}],"Room 106":[{"id":344,"date":"2015-10-16T10:00:00-04:00","start":"10:00","duration":"01:00","room":"Room 106","title":"Introduction to ReactJS","track":"React.JS (106)","type":"lecture","abstract":"React.js is a view library from Facebook for building performant user-interfaces in JavaScript. In this session, we'll explore React.js and understand why it's a great step forward for building complex UI's that run fast. We'll code up an example web application using React.js and step through the basics of using the library while discussing concepts like the virtual DOM and components.","persons":[{"id":283,"full_public_name":"Taggart Bowen-Gaddy","abstract":"Taggart is a front end developer passionate about the future of the browser and building powerful web applications.  He is a believer in declarative, functional, human-readable code and abstractions that make our lives as developers easier.","twitter_name":"taggartbg","avatar_path":"/system/avatars/283/large/me.jpg?1438816304"}]},{"id":345,"date":"2015-10-16T11:00:00-04:00","start":"11:00","duration":"01:00","room":"Room 106","title":"Let's Talk about Flux","track":"React.JS (106)","type":"lecture","abstract":"When Facebook debuted Flux, they were not only introducing a new pattern for UI development, but also presenting lessons learned of their problems encountered with <abbr title=\"Model View Controller and its derivatives\">MVC</abbr> implementations. Additionally, following its announcement, there has been a wave of flux implementations and it's easy to get lost trying to understand the core motivations behind the pattern. We'll cover problems intrinsic to <abbr title=\"Model View Controller and its derivatives\">MVC</abbr> and the motivating factors that led to the creation of Flux.","persons":[{"id":284,"full_public_name":"Andrew Smith","abstract":"Software craftsman, Agile enthusiast and practitioner of TDD, I am passionate about creating quality software. As a strong subscriber to the SOLID principles and TDD, I strive to develop with agility. A student at heart, I also teach to aid others in their journey. I firmly believe in continual growth and am constantly in pursuit of improvement in all things I do.","twitter_name":"andrew_codes","avatar_path":"/system/avatars/284/large/IMG_0061.jpg?1439213242"}]},{"id":165,"date":"2015-10-16T13:00:00-04:00","start":"13:00","duration":"01:00","room":"Room 106","title":"Dataflow through React","track":"React.JS (106)","type":"lecture","abstract":"React is declarative, fast, properly couples HTML with JavaScript, and is easy to reason about. However, the first hurdle you face when building UI components with React is how your data will flow through your app. Let's examine modern best practices of building loosely coupled, well architected React components.","persons":[{"id":113,"full_public_name":"Clint Ayres","abstract":"I'm a front end web developer for <a href=\"http://www.theice.com\">ICE</a> here in Atlanta. I've been working with React for since beginning of 2014. I advocate FLUX and Immutable data when working with React. I am always looking for new patterns that further separate concerns in React components.  This conference I hope to share all the lessons learned from the past two years and explain how to build high performance and maintainable React applications.","twitter_name":"","avatar_path":"/system/avatars/113/large/1869117.jpeg?1409065085"}]},{"id":263,"date":"2015-10-16T14:00:00-04:00","start":"14:00","duration":"01:00","room":"Room 106","title":"Building HUGE Flux Codebases without Compromise","track":"React.JS (106)","type":"lecture","abstract":"Flux Architecture is quickly becoming the widely accepted standard for building scalable frontends that are easy to understand and test.  The main issue is that there is no single Flux framework nor a prescribed way to organize and test very large codebases.  In this talk you will see real examples of flux directory structure, architecture patterns built to scale and learn about a very opinionated way of thoroughly testing Flux applications.\r\n","persons":[{"id":234,"full_public_name":"Jordan Garcia","abstract":"Since founding an instructional gaming website out of his college apartment, Jordan has loved building great experiences on the web.  Currently the Frontend Lead at Optimizely, he's implemented everything from build systems to UI frameworks.  Jordan is also the creator of the first implementation of Flux Architecture to use Immutable data and Functional Reactive Programming, NuclearJS.","twitter_name":"jordanjgarcia","avatar_path":"/system/avatars/234/large/jordan1.jpg?1435685841"}]},{"id":365,"date":"2015-10-16T15:30:00-04:00","start":"15:30","duration":"01:00","room":"Room 106","title":"Exploring React.Native","track":"React.JS (106)","type":"lecture","abstract":"React Native enables you to build world-class application experiences on native platforms using a consistent developer experience based on JavaScript and React. The focus of React Native is on developer efficiency across all the platforms you care about — learn once, write anywhere.","persons":[{"id":73,"full_public_name":"Josh Jensen","abstract":"Currently a freelance mobile application consultant, Josh brings over 12 years of design, architecture, development and passion to his projects and presentations. In the almost 4 years he has been using Titanium, he has brought hundreds of applications to market for companies ranging from Fortune 500 to startup, as well as contributing to projects like ChariTi and TiDev.io. End to end application structure, including mobile and server application architecture, are just a few of the tools Josh has collected over the years and he is passionate about sharing them with others. Come say hi and he might just buy you a beer.","twitter_name":"joshj","avatar_path":"/system/avatars/73/large/IMG_7461.JPG?1412262256"}]},{"id":216,"date":"2015-10-16T16:30:00-04:00","start":"16:30","duration":"01:00","room":"Room 106","title":"Why is React “functional\"?","track":"React.JS (106)","type":"lecture","abstract":"We all know that React works, but being functional implies so much more than the typical dictionary definition would imply. Using React and Om as an example, I’d like to walk you through some tenets of functional programming. A win much bigger than the words ‘virtual dom’ exists in React, and through my examples, you’ll see what makes reasoning about functional systems such a treat. ","persons":[{"id":208,"full_public_name":"John K. Paul","abstract":"John K. Paul is the organizer of the NYC HTML5 meetup group, the VP of engineering at Penton Media and former lead technical architect of Condé Nast's platform engineering team.  He is a also contributor to a few open source projects including requireify, jquery-ajax-retry and one single commit into jQuery.","twitter_name":"johnkpaul","avatar_path":"/system/avatars/208/large/John_Paul_RGB_(1).jpg?1435532764"}]}],"Room 105":[{"id":204,"date":"2015-10-16T10:00:00-04:00","start":"10:00","duration":"01:00","room":"Room 105","title":"Unit Testing Node.JS with Mocha, Chai, and Sinon","track":"Server-side JavaScript (105)","type":"lecture","abstract":"Code-heavy demonstration that shows how to unit-test Node.js using Mocha, Chai, and Sinon.  The focus will be on using Sinon stubs for functions that contain external dependencies such as ExpressJS and MongooseJS.","persons":[{"id":196,"full_public_name":"Lee Carter","abstract":"MEAN-Stack Developer.  Committed to Lean and Agile software development values, principles and practices, with an emphasis on automated testing and Behavior-Driven Development (BDD).  Skilled at all phases of the application lifecycle.\r\n","twitter_name":"wleecarter","avatar_path":"/system/avatars/196/large/420x647.jpg?1435005422"}]},{"id":173,"date":"2015-10-16T11:00:00-04:00","start":"11:00","duration":"01:00","room":"Room 105","title":"Developing Applications using Grunt","track":"Server-side JavaScript (105)","type":"lecture","abstract":"How using Grunt can aid in the development of JavaScript code.","persons":[{"id":68,"full_public_name":"Trevor Ward","abstract":"Appcelerator Titanium Titan. Coder, Geek & blogger","twitter_name":"untward","avatar_path":"/system/avatars/68/large/12593df.jpg?1408124419"}]},{"id":341,"date":"2015-10-16T13:00:00-04:00","start":"13:00","duration":"01:00","room":"Room 105","title":"Scaling Node.js with Docker and Kubernetes","track":"Server-side JavaScript (105)","type":"lecture","abstract":"Writing the code for your applications is loads of fun, but often deploying your application and then scaling it to match your load can be hard and frustrating.\r\n\r\nThe new world of software containers such as Docker can provide you with standard and repeatable ways to solve these problems, and manage a large chunk of your application deployment and scaling needs.\r\n\r\nIn this talk we will take a simple Node.js application, and use it look at some of the basics of Docker, such as writing Dockerfiles, building images and pushing to registries. Finally we will deploy our code to the open source Kubernetes project so we can then scale our application across multiple running containers and machines.","persons":[{"id":282,"full_public_name":"Mark Mandel","abstract":"Mark Mandel is a Developer Advocate for the Google Cloud Platform. Hailing from Australia, Mark built his career developing backend web applications which included several widely adopted open source projects, and running an international conference in Melbourne for several years. Since then he has focused on becoming a polyglot developer, building systems in Go, JRuby and Clojure on a variety of infrastructures. In his spare time he plays with his dog, trains martial arts and reads too much fantasy literature.","twitter_name":"Neurotic","avatar_path":"/system/avatars/282/large/IMG_1550-4_Mark_sq.png?1438623417"}]},{"id":339,"date":"2015-10-16T14:00:00-04:00","start":"14:00","duration":"01:00","room":"Room 105","title":"Running JavaScript Inside the Database","track":"Server-side JavaScript (105)","type":"lecture","abstract":"In this session Romans will tell you about a computing engine that is built into the database and allows arbitrary JavaScript-based code to be executed directly inside the database.\r\nThis setup provides a simple and powerful computational model that ensures data is accessed through efficient indices directly in the database, thus massively accelerating data manipulation operations.\r\nThroughout this talk, Romans will present examples of how advanced computation can be done directly in the database, including an analysis of geospatial data, and the application of statistical model-like logistic regression to derive predictions.","persons":[{"id":280,"full_public_name":"Romans Malinovskis","abstract":"CTO at Agile55 and Agile Toolkit","twitter_name":"jurgisorups","avatar_path":"/system/avatars/280/large/romans-new.png?1444066236"}]},{"id":294,"date":"2015-10-16T15:30:00-04:00","start":"15:30","duration":"01:00","room":"Room 105","title":"Testing, the way it should be.","track":"Core JavaScript & Frameworks (ABE)","type":"lecture","abstract":"Testing is the essential bedrock of software, and we can all agree it's a must-have. There are many testing tools for the front end, but most (if not all) suffer from some crippling problems. We’ll explore these problems and the solutions Cypress.io offers to take the pain out of testing.","persons":[{"id":245,"full_public_name":"Brian Mann","abstract":"Brian Mann completed JavaScript on Death Incarnate mode. He enjoys building things that push beyond what most imagine JavaScript can do. He is the creator of Cypress.io, a tool for end-to-end testing, and author of BackboneRails. He also co-organizes of the Atlanta JavaScript Meetup Group.","twitter_name":"@be_mann","avatar_path":"/system/avatars/245/large/brian.jpeg?1439338619"}]},{"id":278,"date":"2015-10-16T16:30:00-04:00","start":"16:30","duration":"00:30","room":"Room 105","title":"The Little Tests That Could: Testing Your Ember.js App","track":"Core JavaScript & Frameworks (ABE)","type":"lecture","abstract":"You know you should write tests, but do you?\r\nTesting your client side code is more important (and more complex) than ever. This session will discuss why you should test your code and what your test suite should include. Using an Ember.js application, we will also cover best practices, tips for how to implement testing using a TDD approach, and lessons we have learned along the way.","persons":[{"id":235,"full_public_name":"Kelly Senna","abstract":"Web developer at Big Nerd Ranch","twitter_name":"simplysenna","avatar_path":"/system/avatars/235/large/sennabw1-1.png?1435700998"}]}],"Room 104":[{"id":178,"date":"2015-10-16T10:00:00-04:00","start":"10:00","duration":"01:00","room":"Room 104","title":"People Over Pixels","track":"Design & UI & UX (104)","type":"lecture","abstract":"Join me as we talk about the foundation of great UX and how to scale our methods. Subtle shifts in thinking can help us continually improve our work for the benefit of everyone it touches, because every great UX method is based in the humanity that surrounds us.","persons":[{"id":174,"full_public_name":"Cliff Seal","abstract":"Husband to April, Sr. UX Engineer at Pardot, starter of Evermore and TuneDig. Into music, WordPress, design thinking, and Truth.","twitter_name":"cliffseal","avatar_path":"/system/avatars/174/large/avatar.jpg?1434039226"}]},{"id":306,"date":"2015-10-16T11:00:00-04:00","start":"11:00","duration":"01:00","room":"Room 104","title":"All Together Now: How UX Fuels & Engages Online Communities","track":"Design & UI & UX (104)","type":"lecture","abstract":"What’s in an online community? It’s more than you think. From sharing knowledge to organizing events, “lurking” to influencing, everyone wants to be heard online — and no one wants to be left behind. ","persons":[{"id":251,"full_public_name":"Jenny Sun","abstract":"Jenny Sun believes that exceptional experiences begin with a burning desire to facilitate meaningful connections between businesses and their communities. As Field co-founder and user experience lead, her goal is to help organizations meet their customers’ unique needs, encourage internal collaboration, and promote future-forward practices that unite innovation with grace.","twitter_name":"@SunSilvestri","avatar_path":"/system/avatars/251/large/140819_jennysun_360px.jpg?1435777346"}]},{"id":295,"date":"2015-10-16T13:00:00-04:00","start":"13:00","duration":"01:00","room":"Room 104","title":"Design Is Your Job Too","track":"Design & UI & UX (104)","type":"lecture","abstract":"The belief that design and development have competing interests can stand in the way of successful collaboration. In reality, the principles of good design often mirror those of good development. By throwing away stereotypes and allowing both designers and developers to contribute at each step, we can harness the skill sets of each team member to push the boundaries of technology.","persons":[{"id":244,"full_public_name":"Whitney Williams","abstract":"Whitney Williams is a designer-turned-developer from Greenville, SC. She writes code and blog posts, teaches HTML and CSS to cute little kids, and is up for any adventure that adds stamps to her passport.","twitter_name":"@whitneyhacks","avatar_path":"/system/avatars/244/large/Resume_photo_2.png?1439047753"}]},{"id":248,"date":"2015-10-16T14:00:00-04:00","start":"14:00","duration":"01:00","room":"Room 104","title":"The Art of Managing Form and Function","track":"Design & UI & UX (104)","type":"lecture","abstract":"User Experience strategy, design, and development are intertwined more than ever. New workflows are emerging, and most companies are un-prepared for the change. This talk will delve into the collaboration methodologies which combine Creative and Development resources into patterns which increase collaboration and communication, speed delivery,  and ultimately lead to better user experiences.","persons":[{"id":227,"full_public_name":"Jason Rhoades","abstract":"Jason is the Founder of Toolbox No. 9 -- a UX/UI Design and Development agency in Atlanta, Georgia.","twitter_name":"tb9jason","avatar_path":"/system/avatars/227/large/Toolbox9_BeriIrving-148.jpg?1435674441"}]},{"id":308,"date":"2015-10-16T15:30:00-04:00","start":"15:30","duration":"01:00","room":"Room 104","title":"The Death of the Sitemap","track":"Design & UI & UX (104)","type":"lecture","abstract":"Information Architecture has changed. We no longer design in pages, we design in systems, and more specifically, in objects. Tree-like site maps are rarely relevant or helpful anymore, instead we need to design webs of interlocking, nesting, Rubik's cubing, intertwingling objects. ","persons":[{"id":252,"full_public_name":"Sophia Voychehovski","abstract":"Founder of Rewired, a UX studio that consults non-profits and start-ups. A recovering perfectionist, Sophia specializes in MVPifying, complexity elimination, and ruthless prioritization. She must constantly remind herself, and her clients: done is better than perfect. ","twitter_name":"Sophiavux","avatar_path":"/system/avatars/252/large/sophia.jpg?1439338158"}]},{"id":227,"date":"2015-10-16T16:30:00-04:00","start":"16:30","duration":"01:00","room":"Room 104","title":"Designing for Animation","track":"Design & UI & UX (104)","type":"lecture","abstract":"Interfaces that move and react in life-like ways to human behavior used to be the stuff of movies and science fiction. But as devices and software have improved, animation in the UI has quickly become a user expectation.\r\nIn this talk, Angie Terrell will walk through essential interaction design principles to consider when designing animation for user interfaces. She will also discuss how designers can create animated prototypes to test and deliver their ideas.  ","persons":[{"id":212,"full_public_name":"Angie Terrell","abstract":"","twitter_name":"@angie_terrell","avatar_path":"/system/avatars/212/large/angie.jpeg?1439338578"}]}],"Ballroom F":[{"id":137,"date":"2015-10-16T10:00:00-04:00","start":"10:00","duration":"01:00","room":"Ballroom F","title":"Core JavaScript: Syncing Async","track":"Core JavaScript & Frameworks (ABE)","type":"lecture","abstract":"\"Callback hell\" has little to do with callbacks. Are promises delivering on the promise of better async flow control, or muddying the waters? Generating general generators, WAT? Let's wade through the world of async in JS to find order in the chaos.","persons":[{"id":145,"full_public_name":"Kyle Simpson","abstract":"Kyle Simpson is an Open Web Evangelist from Austin, TX, who's passionate about all things JavaScript. He's an author, workshop trainer, tech speaker, and OSS contributor/leader.","twitter_name":"getify","avatar_path":"/system/avatars/145/large/kylesimpson.png?1432088583"}]},{"id":313,"date":"2015-10-16T11:00:00-04:00","start":"11:00","duration":"01:00","room":"Ballroom F","title":"TypeScript for Regular Folks Like Me","track":"Core JavaScript & Frameworks (ABE)","type":"lecture","abstract":"If you're like me, you've probably heard of TypeScript but never used it. This talk provides a down-to-earth look at TypeScript, a statically typed superset of JavaScript that compiles to plain JavaScript. TypeScript also adds optional static types, classes, interfaces, and modules to JavaScript. This session will consist of a guided tour of TypeScript, showing how the language and toolset makes it easier to write cross-platform, large-scale JavaScript applications.","persons":[{"id":257,"full_public_name":"Michael Crump","abstract":"Michael Crump works at Telerik and is a coder, blogger and speaker of various software development topics. He has a passion for a wide range of technology stacks that involve web and mobile. In his free time, he likes to experiment with wearables and is a big fan of IoT. Michael can be found on twitter at @mbcrump or by visiting michaelcrump.net.","twitter_name":"mbcrump","avatar_path":"/system/avatars/257/large/new-michael-crump-300x300.png?1435887062"}]},{"id":134,"date":"2015-10-16T13:00:00-04:00","start":"13:00","duration":"01:00","room":"Ballroom F","title":"Introduction to ES6","track":"Core JavaScript & Frameworks (ABE)","type":"lecture","abstract":"This will be an introduction to ES6 focused at intermediate to advanced JavaScript developers that are looking to take their first dive into ES6.","persons":[{"id":141,"full_public_name":"JD","abstract":"ATL local. JavaScript instructor at The Iron Yard. Formally a developer for Emcien. Contributed to Backbone.js and D3.js. Created GitGutter.","twitter_name":"jisaacks","avatar_path":"/system/avatars/141/large/jd_headshot.jpg?1432001892"}]},{"id":351,"date":"2015-10-16T14:00:00-04:00","start":"14:00","duration":"00:40","room":"Ballroom F","title":"Saving time with javascript apps as build artifacts","track":"Core JavaScript & Frameworks (ABE)","type":"lecture","abstract":"Treating JavaScript code after it goes through a build system like grunt or gulp as a build artifact solves specific problems as projects grow in size, complexity, and number of supported platforms — particularly mobile. This talk focuses on the technical details of how artifact repositories work with a modern JavaScript development workflow and why it’s useful we think about the JavaScript code we write for the web this way.\r\n","persons":[{"id":289,"full_public_name":"Clay Smith","abstract":"Clay Smith is a developer advocate at NewRelic. He lives in San Francisco.","twitter_name":"smithclay","avatar_path":"/system/avatars/289/large/clay-smith.jpg?1440610689"}]},{"id":189,"date":"2015-10-16T15:30:00-04:00","start":"15:30","duration":"01:00","room":"Ballroom F","title":"Easy Data Visualization with JavaScript","track":"Core JavaScript & Frameworks (ABE)","type":"lecture","abstract":"Do you need to visualize data on your web site? If so, there are many great JavaScript libraries that can help, and this talk will introduce you to many of them. We'll cover the different types of visualizations and the best open source libraries for creating them.","persons":[{"id":27,"full_public_name":"Stephen A Thomas","abstract":"Stephen specializes in front-end development at Georgia Tech’s Department of Education Technology where he is helping to build the <a href=\"http://www.oaeproject.org\">Open Academic Environment</a>. He is the author of <a href=\"http://www.amazon.com/Stephen-A.-Thomas/e/B000APYM22\">several books</a> on the Internet and networking technology and has written about JavaScript development for <a href=\"http://mobile.smashingmagazine.com/2013/07/22/simple-responsive-images-with-css-backgrounds/\">Smashing Magazine</a>, <a href=\"http://www.sitepoint.com/unit-testing-backbone-js-applications/\">sitepoint</a> and <a href=\"http://ui-cloud.com/web-based-visualization-part-1-the-d3-js-key-concept/\">others</a>. His most recent book is <em>Building JavaScript Visualizations</em> from No Starch Press.","twitter_name":"stephen_thomas","avatar_path":"/system/avatars/27/large/sathomas.me.png?1434131817"}]},{"id":190,"date":"2015-10-16T16:30:00-04:00","start":"16:30","duration":"01:00","room":"Ballroom F","title":"Advanced Data Visualization with D3.js","track":"Core JavaScript & Frameworks (ABE)","type":"lecture","abstract":"There's no better tool than D3.js for creating advanced, interactive data visualizations. This talk explores that library by dissecting an advanced, custom visualization. In addition to learning about many of D3's advanced capabilities, we'll cover important visualization principles such as structuring data, color theory, and animation.","persons":[{"id":27,"full_public_name":"Stephen A Thomas","abstract":"Stephen specializes in front-end development at Georgia Tech’s Department of Education Technology where he is helping to build the <a href=\"http://www.oaeproject.org\">Open Academic Environment</a>. He is the author of <a href=\"http://www.amazon.com/Stephen-A.-Thomas/e/B000APYM22\">several books</a> on the Internet and networking technology and has written about JavaScript development for <a href=\"http://mobile.smashingmagazine.com/2013/07/22/simple-responsive-images-with-css-backgrounds/\">Smashing Magazine</a>, <a href=\"http://www.sitepoint.com/unit-testing-backbone-js-applications/\">sitepoint</a> and <a href=\"http://ui-cloud.com/web-based-visualization-part-1-the-d3-js-key-concept/\">others</a>. His most recent book is <em>Building JavaScript Visualizations</em> from No Starch Press.","twitter_name":"stephen_thomas","avatar_path":"/system/avatars/27/large/sathomas.me.png?1434131817"}]}],"Ballroom D":[{"id":132,"date":"2015-10-16T10:00:00-04:00","start":"10:00","duration":"01:00","room":"Ballroom D","title":"Building Native Mobile Apps with Javascript","track":"Mobile (C)","type":"lecture","abstract":"Titanium, Native Script, React Native, and others promise cross platform mobile applications from a common code base. Let's take a closer look at each platform's advantages and disadvantages to find out what is the best option for you and your project.","persons":[{"id":73,"full_public_name":"Josh Jensen","abstract":"Currently a freelance mobile application consultant, Josh brings over 12 years of design, architecture, development and passion to his projects and presentations. In the almost 4 years he has been using Titanium, he has brought hundreds of applications to market for companies ranging from Fortune 500 to startup, as well as contributing to projects like ChariTi and TiDev.io. End to end application structure, including mobile and server application architecture, are just a few of the tools Josh has collected over the years and he is passionate about sharing them with others. Come say hi and he might just buy you a beer.","twitter_name":"joshj","avatar_path":"/system/avatars/73/large/IMG_7461.JPG?1412262256"}]},{"id":229,"date":"2015-10-16T11:00:00-04:00","start":"11:00","duration":"01:00","room":"Ballroom D","title":"Mobile development with Ionic & Angular","track":"Mobile (C)","type":"lecture","abstract":" Ionic provides a solution for all of these platforms and uses a language that runs on every one of them: Javascript. Learn more about Ionic and create your cross platform app in this talk.","persons":[{"id":216,"full_public_name":"Mike Hartington","abstract":"Ionic Developer, open source contributor, beer lover. Based out of beautiful Rhode Island.","twitter_name":"@mhartington","avatar_path":"/system/avatars/216/large/mike-headshot.png?1435605936"}]},{"id":195,"date":"2015-10-16T13:00:00-04:00","start":"13:00","duration":"00:40","room":"Ballroom D","title":"Recreating Classic Arcade Games for Mobile Using JavaScript","track":"Mobile (C)","type":"lecture","abstract":"See your favorite arcade games, recreated as truly native iOS and Android apps, using only a single code base written entirely in JavaScript.  Peach Pellen and John Gould will demonstrate how you can build a clone of any classic or modern arcade game, from PAC-MAN to Flappy Bird, using Platino; a mobile game engine built on the idea that JavaScript is the future of programming.","persons":[{"id":248,"full_public_name":"Peach Pellen","abstract":"7 years experience in an 8 year old industry, an Intel Innovator and core developer of over 100 games. Code written by Peach has been \r\nused by more than 35,000 developers in over 70,000 unique apps. Peach is CTO of Black Gate Games, creators of the Platino Engine.","twitter_name":"peachpellen","avatar_path":"/system/avatars/248/large/c3c30300eb.jpg?1438904675"},{"id":185,"full_public_name":"John Gould","abstract":"Entrepreneur, founder of Avatar Software and Black Gate Games.  John has been a lifelong gamer and has loved building web applications, mobile apps and most recently mobile games using JavaScript since he was a teenager.","twitter_name":"AvatarJohn","avatar_path":"/system/avatars/185/large/IMG_5201.JPG?1435723331"}]},{"id":336,"date":"2015-10-16T14:00:00-04:00","start":"14:00","duration":"01:00","room":"Ballroom D","title":"Getting Started with Swift on iOS, Part 1","track":"Mobile (C)","type":"workshop","abstract":"Intro to Mobile Development with IOS and Swift","persons":[{"id":276,"full_public_name":"Shawn Johnson","abstract":"Shawn Johnson is a mobile architect with over 19 years of development experience. He has extensive experience creating mobile solutions for Fortune 500 companies including AT&T, IHG, Coke, HomeDepot.","twitter_name":"digitalsleep","avatar_path":"/system/avatars/276/large/meinblack.png?1437171727"}]},{"id":347,"date":"2015-10-16T15:30:00-04:00","start":"15:30","duration":"01:00","room":"Ballroom D","title":"Getting Started with Swift on iOS, Part 2","track":"Mobile (C)","type":"lecture","abstract":"Intro to Mobile Development with IOS and Swift","persons":[{"id":276,"full_public_name":"Shawn Johnson","abstract":"Shawn Johnson is a mobile architect with over 19 years of development experience. He has extensive experience creating mobile solutions for Fortune 500 companies including AT&T, IHG, Coke, HomeDepot.","twitter_name":"digitalsleep","avatar_path":"/system/avatars/276/large/meinblack.png?1437171727"}]},{"id":145,"date":"2015-10-16T16:30:00-04:00","start":"16:30","duration":"01:00","room":"Ballroom D","title":"Expanding Your Nativescript App with Native Libraries ","track":"Mobile (C)","type":"lecture","abstract":"Learn how to leverage Nativescript's meta generator to access external native libraries from within your mobile apps JavaScript code.","persons":[{"id":81,"full_public_name":"Stephen Feather","abstract":"Stephen Feather founded Feather Direct in 2009, recognizing a need for quality mobile app development, reputation management, and SEO services for smaller organizations. He worked directly with communications companies such as Netscape, Microsoft, and Oracle in the early days of the Internet. In 1996 he authored JavaScript by Example, one of the first publications on the then-new scripting language. He volunteers time to assist and train a new generation of app developers through online forums and local user groups.","twitter_name":"stephenfeather","avatar_path":"/system/avatars/81/large/n747527867_2041530_7318_400x400.jpg?1408461618"}]}],"Ballroom C":[{"id":370,"date":"2015-10-16T08:10:00-04:00","start":"08:10","duration":"00:40","room":"Ballroom C","title":"Women Who Code Reception (Ballroom C)","track":"Admin","type":"lecture","abstract":"Women Who Code Reception (Ballroom C): Join us for a quick meet and greet before the conference starts!","persons":[]},{"id":337,"date":"2015-10-16T10:00:00-04:00","start":"10:00","duration":"01:00","room":"Ballroom C","title":"Functional PHP","track":"PHP (115)","type":"lecture","abstract":"Functional programming isn't a language, but a powerful approach to problem solving.  And it's fully available to us in PHP!  Let's see what functional programming is, and how PHP developers can leverage it to develop robust and comprehensible programs.","persons":[{"id":279,"full_public_name":"Larry Garfield","abstract":"Larry Garfield is a software architect, PHP guru, Drupal core developer, Drupal ambassador, correctness nerd, and all around (mostly) lovable pedant on the subjects of software engineering and computer science.","twitter_name":"Crell","avatar_path":"/system/avatars/279/large/Larry-website.jpg?1437521710"}]},{"id":300,"date":"2015-10-16T11:00:00-04:00","start":"11:00","duration":"01:00","room":"Ballroom C","title":"Automated Browser Testing with Selenium and PHPUnit","track":"PHP (115)","type":"lecture","abstract":"","persons":[{"id":249,"full_public_name":"Joshua Silver","abstract":"Joshua Silver is VP, Product Development and the technical co-founder of Patientco, a healthcare IT and payments startup in Atlanta. At Patientco, he is responsible for overall product direction, R&D initiatives, and technology strategy. Joshua has over a decade of development (mostly PHP/MySQL) and product management experience and frequently speaks on topics such as consumer-centric system design, secure payment processing, and scalable web architecture. Joshua holds a BS in Computer Science from GA Tech. When not working, Joshua is most likely traveling and has been to nearly 30 countries.","twitter_name":"1yellowbrick","avatar_path":"/system/avatars/249/large/joshua_silver_headshot_2.jpg?1439393630"}]},{"id":255,"date":"2015-10-16T13:00:00-04:00","start":"13:00","duration":"01:00","room":"Ballroom C","title":"Building a Web App in Go","track":"PHP (115)","type":"lecture","abstract":"This talk covers the basics of creating a web application in Go and shows how to do things like session handling, templating and posting forms that you're used to doing in PHP.  ","persons":[{"id":192,"full_public_name":"Andy Watson","abstract":"Andy Watson is a software person in Atlanta that can't \r\nquite figure out how to describe himself in the third \r\nperson without sounding weird.\r\n\r\n","twitter_name":"andrewwatson","avatar_path":"/system/avatars/192/large/andy_watson-300x300.jpg?1439322290"}]},{"id":158,"date":"2015-10-16T14:00:00-04:00","start":"14:00","duration":"01:00","room":"Ballroom C","title":"Action-Domain-Responder","track":"PHP (115)","type":"lecture","abstract":"Using Model-View-Controller as a pattern to describe stateless HTTP interactions has always been a bit of a kludge. There simply hasn't been a better pattern web applications -- until now.  ADR (Action-Domain-Responder) represents a refinement of generic MVC as an application architecture specifically tuned to the web. In this talk, we will discuss various patterns of overall application architecture, including MVC, MVP, PAC, DCI, RMR, and others. We will find out how the ADR pattern arises from generic MVC, and how it provides a better description of how web applications actually work. Finally, we will go over examples of how to architect an ADR application, as well as how to convert from an MVC architcture to an ADR one.\r\n","persons":[{"id":158,"full_public_name":"Paul M. Jones","abstract":"Internationally-recognized PHP expert; <a href=\"http://php-fig.org\">PHP-FIG</a> founding member; primary author on PSR-1, PSR-2, and PSR-4; author of <a href=\"https://leanpub.com/mlaphp\">Modernizing Legacy Applications in PHP</a>; lead on the <a href=\"http://auraphp.com\">Aura</a> and <a href=\"https://github.com/radarphp/Radar.Project\">Radar</a> projects; defined the <a href=\"http://pmjones.io/adr\">Action-Domain-Responder</a> pattern.","twitter_name":"pmjones","avatar_path":"/system/avatars/158/large/IMG_3665-sq.jpg?1432761757"}]},{"id":310,"date":"2015-10-16T15:30:00-04:00","start":"15:30","duration":"01:00","room":"Ballroom C","title":"Just married: Node.js and PHP","track":"PHP (115)","type":"lecture","abstract":"When Node.js made its first appearance in 2009 many declared that to be the end of PHP. Yet today, about 6 years later, both environments are very much alive and kicking! Even better: Combining the two may very well be the answer to the needs of the next generation of web applications.","persons":[{"id":246,"full_public_name":"Arne Blankerts","abstract":"Arne Blankerts designs reliable infrastructures and relentlessly eliminates security holes. ","twitter_name":"arneblankerts","avatar_path":"/system/avatars/246/large/arne.jpg?1438984949"}]}],"Ballroom ABE":[{"id":305,"date":"2015-10-16T09:00:00-04:00","start":"09:00","duration":"01:00","room":"Ballroom ABE","title":"Everything I Needed to Know, I Learned in Rabbinical School (Ballroom ABE)","track":"Keynote","type":"lecture","abstract":"You’ve been programming for a while now. You’re beginning to feel that you’ve got a handle on things but at the same time can’t escape the feeling that you’ve somehow plateaued in your growth as a software developer. In this talk Yitzchok, a rabbinic scholar and software developer, shares the “wisdom of the sages” as practical, actionable advice – strategies and tactics – that you can use to reinvigorate your growth as a software developer.","persons":[{"id":250,"full_public_name":"Yitzchok Willroth","abstract":"Yitzchok Willroth is a Talmudic scholar and software craftsman (though seldom at the same time!) living in Lakewood, New Jersey.  A start-up veteran, dev bootcamp instructor and frequent conference speaker, Yitzchok is the founder & organizer of the ShorePHP User Group, a co-organizer of the NYPHP User Group, and an active participant in the PHPMentoring Initiative. Yitzchok is also the driving force behind the Wisdom as a Service World Tour, a year long effort to engage over 50 User Groups around the world in a conversation about Community, Software Craftsmanship, Personal Growth & Professional Development. In his role as the Engineering Practice Manager for Grovo Learning, he has found the perfect vehicle for sharing his passion for thoughtful software design while helping to build the next generation learning ecosystem for the 21st Century workforce.","twitter_name":"@coderabbi","avatar_path":"/system/avatars/250/large/newporfilepic.PNG?1438816490"}]},{"id":217,"date":"2015-10-16T10:00:00-04:00","start":"10:00","duration":"01:00","room":"Ballroom ABE","title":"JS.Next: ES6 Overview","track":"Core JavaScript & Frameworks (ABE)","type":"lecture","abstract":"Coming soon, in a theater near you. It’s bigger than Ultron. It’s better than Ultron. It’s more ubiquitous than Robert Downey Jr. It’s ES6, JavaScript’s next in-your-face revsion. You’ve never seen a sequel, until you’ve seen this. I’d like to take you all to the movies. Explain to you all about ES6, and what new features are accessible now, even in older browsers or node.js. You’ll see what we can access with a single new script tag. I’ll also go through many of the features that are “transpilable” and explain what that means. I’ll even go so far as to say why some don’t like the word “transpile” at all. It’ll be an excuse for me to get into the fun and tangled web of compilers. The goal of this workshop will be to give everyone a taste and experience of the future JavaScript features that we can all use with only a few tweaks to our current processes.","persons":[{"id":208,"full_public_name":"John K. Paul","abstract":"John K. Paul is the organizer of the NYC HTML5 meetup group, the VP of engineering at Penton Media and former lead technical architect of Condé Nast's platform engineering team.  He is a also contributor to a few open source projects including requireify, jquery-ajax-retry and one single commit into jQuery.","twitter_name":"johnkpaul","avatar_path":"/system/avatars/208/large/John_Paul_RGB_(1).jpg?1435532764"}]},{"id":343,"date":"2015-10-16T11:00:00-04:00","start":"11:00","duration":"01:00","room":"Ballroom ABE","title":"Introduction to Web Components and Polymer","track":"Core JavaScript & Frameworks (ABE)","type":"lecture","abstract":"There are numerous component-based web frameworks and JavaScript widget libraries. They allow you to build custom UI components, but those components won’t work outside of the framework. It's also hard to mix and match UI components from different frameworks.\r\n\r\nWouldn’t it be nice if there were a standard way to build a UI component that runs in a browser? A component model that is part of the open web? Finally, there is: HTML5 Web Components, an emerging standard from the Web Applications Working Group (WAWG).","persons":[{"id":160,"full_public_name":"Kito Mann","abstract":"Kito D. Mann is the Principal Consultant at Virtua, Inc., specializing in enterprise application architecture, training, development, and mentoring with JavaServer Faces, HTML5, portlets, Liferay, and Java EE technologies. He is also the editor-in-chief of JSFCentral.com (www.jsfcentral.com), co-host of the Enterprise Java Newscast (http://www.enterprisejavanews.com), host of the JSF Podcast interview series (http://www.jsfcentral.com/resources/jsfcentralpodcasts/), and the author of JavaServer Faces in Action (Manning). Mann has participated in several Java Community Process expert groups (including CDI, JSF and Portlets) and is also an internationally recognized speaker. He holds a BA in Computer Science from Johns Hopkins University.","twitter_name":"kito99","avatar_path":"/system/avatars/160/large/kito-mann-small.jpg?1438802820"}]},{"id":261,"date":"2015-10-16T13:00:00-04:00","start":"13:00","duration":"01:00","room":"Ballroom ABE","title":"Orchestrating Apps by Composing Angular Directives","track":"Core JavaScript & Frameworks (ABE)","type":"lecture","abstract":"Building large apps in Angular can be tricky. If we’re not careful, we can still  build monolithic applications even with the wonderful magic of Angular. We still need the principles of modularity and separation of concerns. Learn how we can get behind the reusable component movement and compose directives to build applications.","persons":[{"id":129,"full_public_name":"Jeremy Fairbank","abstract":"Jeremy Fairbank is a remote web developer in Tennessee. He works for Push Agency with an entirely distributed team that creates amazing designs and software. He has worked on the front end and back end extensively with Angular, Backbone, Marionette, and Ruby on Rails. He blogs at <a href=\"http://blog.jeremyfairbank.com\">blog.jeremyfairbank.com</a> and has been featured on JSWeekly a few times. Outside of developing, he enjoys being a husband and father as well as playing guitar.","twitter_name":"@elpapapollo","avatar_path":"/system/avatars/129/large/bio-photo-1-600x600.jpg?1435679574"}]},{"id":340,"date":"2015-10-16T14:00:00-04:00","start":"14:00","duration":"01:00","room":"Ballroom ABE","title":"RESTing in AngularJS","track":"Core JavaScript & Frameworks (ABE)","type":"lecture","abstract":"Asynchronous AJAX calls, especially those that deal with REST principles are something that all client side frameworks support, and AngularJS is no different. However, in order to truly benefit from AngularJS's support for asynchronous calls, one must understand the various moving parts that make this a reality. This includes promises (with AngularJS' $q library), $http and $resource.\r\nIn this session we will explore all the three components that make async calls in AngularJS possible. We will start with understanding the “why” of promises, and how we are to consume and produce promises. We will then dive into some of the inner workings of $http and how it leverages promises under the covers. We will end with an overview of $resource, which combines $http and promises to make working with REST-ful resources a breeze.","persons":[{"id":115,"full_public_name":"Raju Gandhi","abstract":"I am a Software Craftsman with over a decade of experience building Web Applications and Enterprise Software and I love to build great software","twitter_name":"looselytyped","avatar_path":"/system/avatars/115/large/me2_400x400.png?1409064068"}]},{"id":193,"date":"2015-10-16T15:30:00-04:00","start":"15:30","duration":"01:00","room":"Ballroom ABE","title":"Lessons learned with TypeScript and ES2015","track":"Core JavaScript & Frameworks (ABE)","type":"lecture","abstract":"We've learned many lessons with TypeScript and ES2015 in working on Dojo 2.","persons":[{"id":182,"full_public_name":"Dylan Schiemann","abstract":"Dylan Schiemann is CEO of SitePen and co-founder of the Dojo Toolkit.","twitter_name":"dylans","avatar_path":"/system/avatars/182/large/parliament.jpg?1434387283"}]},{"id":258,"date":"2015-10-16T16:30:00-04:00","start":"16:30","duration":"01:00","room":"Ballroom ABE","title":"Functional Programming Basics in ES6","track":"Core JavaScript & Frameworks (ABE)","type":"lecture","abstract":"With all the hubbub over functional programming in JavaScript land, you might be confused what it’s all about. Let’s look at the problems that functional programming can solve more elegantly than imperative programming. We will see why functional programming is an important tool in our bag by enforcing modularity and readability, making code more understandable and easier to test.","persons":[{"id":129,"full_public_name":"Jeremy Fairbank","abstract":"Jeremy Fairbank is a remote web developer in Tennessee. He works for Push Agency with an entirely distributed team that creates amazing designs and software. He has worked on the front end and back end extensively with Angular, Backbone, Marionette, and Ruby on Rails. He blogs at <a href=\"http://blog.jeremyfairbank.com\">blog.jeremyfairbank.com</a> and has been featured on JSWeekly a few times. Outside of developing, he enjoys being a husband and father as well as playing guitar.","twitter_name":"@elpapapollo","avatar_path":"/system/avatars/129/large/bio-photo-1-600x600.jpg?1435679574"}]},{"id":334,"date":"2015-10-16T17:30:00-04:00","start":"17:30","duration":"01:00","room":"Ballroom ABE","title":"Lessons from Open Source @ Scale","track":"Keynote","type":"podium","abstract":"Facebook has a large portfolio of open source projects, each from the company's own production stack, and in areas as diverse as native mobile tools, big data systems, client-side web libraries, backend runtimes, infrastructure, and even hardware designs. Getting to this point has been a journey! - and this keynote will discuss how we got to the point at which Facebook is able to ship new open source projects twice a week, maintain the quality, pace, and community interactions on the existing portfolio, and even a few other lessons and war stories from along the way.","persons":[{"id":294,"full_public_name":"Christine Abernathy","abstract":"Christine is a Developer Advocate on the Open Source team at Facebook, with previous Developer Advocacy roles with Parse and Facebook Platform.  Christine has a passion for developers and mobile technologies, especially iOS and Android. Prior to Facebook, Christine headed up engineering at Mshift, a mobile banking software provider, delivering iOS apps and mobile browser-based products.","twitter_name":"abernathyca","avatar_path":"/system/avatars/294/large/christine_abernathy_2.jpg?1441843941"}]}],"Foyer":[{"id":267,"date":"2015-10-16T08:00:00-04:00","start":"08:00","duration":"01:00","room":"Foyer","title":"Registration","track":"Admin","type":"other","abstract":"","persons":[{"id":7,"full_public_name":"Pratik Patel","abstract":"Pratik Patel is the CTO of Atlanta based startup TripLingo. He’s also an author, speaker, and consultant helping technologists build great apps, and business people make the most of technology. After many years in the big corporate world in places such as New York, London and Hong Long, he’s in the startup space now and hacks iOS, Android, Java, HTML5, CSS3, JavaScript, Rails, and ..... well everything except Perl. You can follow him on twitter at @prpatel.","twitter_name":"prpatel","avatar_path":"/system/avatars/7/large/profile-pic-09-11-2011.jpg?1406354223"}]},{"id":359,"date":"2015-10-16T12:00:00-04:00","start":"12:00","duration":"01:00","room":"Foyer","title":"Lunch Day 1","track":null,"type":"","abstract":"","persons":[]},{"id":269,"date":"2015-10-16T15:00:00-04:00","start":"15:00","duration":"00:30","room":"Foyer","title":"Afternoon Break 1","track":"Admin","type":"other","abstract":"","persons":[{"id":7,"full_public_name":"Pratik Patel","abstract":"Pratik Patel is the CTO of Atlanta based startup TripLingo. He’s also an author, speaker, and consultant helping technologists build great apps, and business people make the most of technology. After many years in the big corporate world in places such as New York, London and Hong Long, he’s in the startup space now and hacks iOS, Android, Java, HTML5, CSS3, JavaScript, Rails, and ..... well everything except Perl. You can follow him on twitter at @prpatel.","twitter_name":"prpatel","avatar_path":"/system/avatars/7/large/profile-pic-09-11-2011.jpg?1406354223"}]},{"id":270,"date":"2015-10-16T18:30:00-04:00","start":"18:30","duration":"01:00","room":"Foyer","title":"Happy hour at the conference venue (Jocks and Jills Grill at Cobb Galleria)!","track":"Admin","type":"other","abstract":"Join us at Jocks n Jills for the happy hour, sponsored by, well, our amazing sponsors!","persons":[{"id":7,"full_public_name":"Pratik Patel","abstract":"Pratik Patel is the CTO of Atlanta based startup TripLingo. He’s also an author, speaker, and consultant helping technologists build great apps, and business people make the most of technology. After many years in the big corporate world in places such as New York, London and Hong Long, he’s in the startup space now and hacks iOS, Android, Java, HTML5, CSS3, JavaScript, Rails, and ..... well everything except Perl. You can follow him on twitter at @prpatel.","twitter_name":"prpatel","avatar_path":"/system/avatars/7/large/profile-pic-09-11-2011.jpg?1406354223"}]}]}},{"index":2,"date":"2015-10-17","day_start":"2015-10-17T08:00:00-04:00","day_end":"2015-10-17T20:00:00-04:00","rooms":{"115":[{"id":230,"date":"2015-10-17T10:00:00-04:00","start":"10:00","duration":"01:00","room":"115","title":"Making a MVP Look Good Without a Designer","track":"Web/HTML/CSS (D)","type":"lecture","abstract":"Bootstrap (http://getbootstrap.com/) is a bonafide sales and marketing term for selling cheap design for a good-looking prototype or minimum viable product.  This will be an introduction to navigating the toolset, documentation, and adding the Bootstrap UI library to your workflow.  I will cover basic components, variables, tooling implementation, and my workflow to customize the components with Sass.","persons":[{"id":143,"full_public_name":"Todd Gandee","abstract":"","twitter_name":"tgandee","avatar_path":"/system/avatars/143/large/todd.jpg?1439339046"}]},{"id":209,"date":"2015-10-17T11:00:00-04:00","start":"11:00","duration":"01:00","room":"115","title":"Writing custom in-browser tools for smarter webapp development","track":"Web/HTML/CSS (D)","type":"lecture","abstract":"Built-in browser development tools are excellent for speeding up webapp development and debugging common issues. But when it comes to the more specific needs of you and your application, you're often on your own. Learn how to create custom, in-browser tools that help you save time developing and supporting your application.","persons":[{"id":199,"full_public_name":"Lyle Shearer","abstract":"A Nebraska native and UNL graduate, Lyle is a software engineer with a deep passion for JavaScript and the ever-evolving development platform that is the web. Working since 2009 at Hudl, a Lincoln-based sports video software company, he has grown into a Front-end Tech Lead position where he can focus on making website development easier, more robust, and performant. Outside of the office, he is a recreational snowboarder and an avid traveler with a hunger for experiencing new cultures.","twitter_name":"@lyleshearer","avatar_path":"/system/avatars/199/large/new_profile_pic.jpg?1435160206"}]},{"id":166,"date":"2015-10-17T13:00:00-04:00","start":"13:00","duration":"01:00","room":"115","title":"So You Wanna Learn About Flexible Box!?","track":"Web/HTML/CSS (D)","type":"lecture","abstract":"The goal of this talk is to introduce flexbox. This talk will briefly cover CSS float, the original layout design method, and its counterpart, the \"clear:both\" fix. A review of the history and continued revisions of flexbox will also be included. Examples of why flexbox became a staple in Autotrader's mobile rewrite and suggestions on incorporating flexbox into your core website will be provided along with graceful degradation techniques.","persons":[{"id":164,"full_public_name":"Marc Ferguson","abstract":"Marc, at his core, is an open source front-end web developer from a galaxy far, far away. When he's not fighting empirical regimes he falls into his role as a mild-mannered husband raising three titans-of-industry. A busy and productive life often requires the counter balance of slothful recreations. For fun Marc pwn noobz, farm resources, and plays-the-objective, which results in a higher state of \"gamerscore.\"","twitter_name":"fergatROn","avatar_path":"/system/avatars/164/large/marc_work6_lightbg_256.jpg?1433330203"}]},{"id":320,"date":"2015-10-17T14:00:00-04:00","start":"14:00","duration":"01:00","room":"115","title":"Performant Animations with Greensock","track":"Core JavaScript & Frameworks (ABE)","type":"lecture","abstract":"For years, we've been under the assumption that JavaScript based animations were the antithesis of performance. Greensock (yes, Flash refugees, that Greensock) is here to challenge that, then bury it. If you need advanced animations in your application, you probably need to have a look.","persons":[{"id":261,"full_public_name":"Michael Johnson","abstract":"Front-end Developer at Huge Inc","twitter_name":"bluekayaks","avatar_path":"/system/avatars/261/large/michael.jpeg?1439338657"}]},{"id":220,"date":"2015-10-17T15:30:00-04:00","start":"15:30","duration":"01:00","room":"115","title":"HADOUKEN! HTML5 Game Development","track":"Web/HTML/CSS (D)","type":"lecture","abstract":"HTML5 presents a great opportunity to create browser based games that work across the array of tablet and smartphone based devices. In the near future, as the device environment becomes more diverse, developers will begin to adopt standards that work across all devices.  With HTML5, Javascript and the free createJS engine, surprisingly sophisticated games can be created. In this workshop session, you'll be invited to code along with the instructor as you create the game Whack-a-mole  and deploy it to a mobile environment. The games graphical and audio assets will be provided to you as you learn the techniques to create HTML5 based game that includes sprite-based graphics, audio, animations and more.\r\n","persons":[{"id":202,"full_public_name":"Mark Lassoff","abstract":"Mark Lassoff is the founder and president of LearnToProgram.tv.  His company produces courses that are educating thousands of software,web and mobile developers online, in the corporate classroom and in secondary schools across the country.  Previous to founding LearnToProgram, Mark started several companies in the Austin, Texas area and continues to promote entrepreneurship and computer science.  He is an in-demand speaker and has traveled the world to teach programming techniques and technologies.  Mark also authors two monthly magazine columns.  He lives in Connecticut, in a 150 year old and is currently redecorating his condo.  Want to help?\r\n","twitter_name":"mlassoff","avatar_path":"/system/avatars/202/large/Mark-400x400.jpg?1438827978"}]},{"id":151,"date":"2015-10-17T16:30:00-04:00","start":"16:30","duration":"01:00","room":"115","title":"Aurelia - the next generation JavaScript framework you will love","track":"Core JavaScript & Frameworks (ABE)","type":"lecture","abstract":"Aurelia is a next generation JavaScript client framework that leverages simple conventions to empower your creativity created by Rob Eisenberg, creator of Durandal, who left Angular 2 team to create cleaner and simpler JavaScript framework of tomorrow written in ECMAScript 7!","persons":[{"id":159,"full_public_name":"Jakub Jedryszek","abstract":"Jakub Jedryszek works for Microsoft as Software Engineer. Currently he is working on <a href=\"http://portal.azure.com\">the Azure Portal</a> – the largest and most complex Single Page Web Application in the World written in TypeScript. He is a founder of <a href=\"http://dotnetconf.pl\">dotNetConfPL</a> – online conference for .NET Developers. His blog is at <a href=\"http://jj09.net\">jj09.net</a>.","twitter_name":"JakubJedryszek","avatar_path":"/system/avatars/159/large/299ad37f586aa79c7e0839fd4a18509a.jpeg?1441225536"}]}],"Room 113":[{"id":144,"date":"2015-10-17T10:00:00-04:00","start":"10:00","duration":"01:00","room":"Room 113","title":"Making the Switch: Moving from Ruby on Rails to Node.js & Express.js","track":"Ruby & Rails (113)","type":"lecture","abstract":"<p>Have you been building applications in Ruby on Rails? Been wanting to take that leap in Node.js? Wait no longer!\r\n<br>In this talk, we will cover how Ruby and Node.js compare, why I loved Rails, and how to build a complete CRUD application with all the REST baked in using MongoDB, Express.js, and Node.js.<p>","persons":[{"id":153,"full_public_name":"Kendrick Coleman","abstract":"<p>Kendrick Coleman is a reformed sysadmin/virtualization ninja/cloud junkie turned coder and awaits for an idea to spawn to tackle it with Ruby or Javascript. In his daily role a developer advocate for <a href=\"http://emccode.github.io/\">EMC {code}</a>, he works with a team to focus and publish all things open source.</p>","twitter_name":"KendrickColeman","avatar_path":"/system/avatars/153/large/avatar_fresh.jpg?1432696670"}]},{"id":368,"date":"2015-10-17T11:00:00-04:00","start":"11:00","duration":"01:00","room":"Room 113","title":"Seat Belts and Airbags for bash","track":"Ruby & Rails (113)","type":"lecture","abstract":"For those of us using web servers on Linux we eventually all use bash to automate starting and stopping the server and running cron jobs for maintenance.  This talk will show you little used features of bash to make it a more reliable.","persons":[{"id":296,"full_public_name":"Michael Potter","abstract":"","twitter_name":"pottmi","avatar_path":"/system/avatars/296/large/23373be.jpg?1442257735"}]},{"id":304,"date":"2015-10-17T13:00:00-04:00","start":"13:00","duration":"01:00","room":"Room 113","title":"Introduction to Technical Product Management for Developers","track":"General Computing","type":"lecture","abstract":"At one time or another, every developer will be faced with having to handle some technical aspects of product management - whether it's dealing with scheduling issues, negotiating project scope, prioritizing bug fixes, or even helping to analyze the cost structure for a new feature. I'll give you some hands-on tips and tricks you can immediately put to use to help you be a more well-rounded developer and contribute to technical product management.\r\n","persons":[{"id":249,"full_public_name":"Joshua Silver","abstract":"Joshua Silver is VP, Product Development and the technical co-founder of Patientco, a healthcare IT and payments startup in Atlanta. At Patientco, he is responsible for overall product direction, R&D initiatives, and technology strategy. Joshua has over a decade of development (mostly PHP/MySQL) and product management experience and frequently speaks on topics such as consumer-centric system design, secure payment processing, and scalable web architecture. Joshua holds a BS in Computer Science from GA Tech. When not working, Joshua is most likely traveling and has been to nearly 30 countries.","twitter_name":"1yellowbrick","avatar_path":"/system/avatars/249/large/joshua_silver_headshot_2.jpg?1439393630"}]},{"id":157,"date":"2015-10-17T14:00:00-04:00","start":"14:00","duration":"01:00","room":"Room 113","title":"It Was Like That When I Got Here","track":"General Computing","type":"lecture","abstract":"The codebase at work is absolutely terrible. It's a mess of spaghetti that has been around for years and is and completely untestable. Any time you fix a bug right here, a new bug appears over there. In this talk, we will find out why the code is so bad, and go through some practical steps on how you can start digging your way out of the legacy hole while keeping the system running the whole time.\r\n","persons":[{"id":158,"full_public_name":"Paul M. Jones","abstract":"Internationally-recognized PHP expert; <a href=\"http://php-fig.org\">PHP-FIG</a> founding member; primary author on PSR-1, PSR-2, and PSR-4; author of <a href=\"https://leanpub.com/mlaphp\">Modernizing Legacy Applications in PHP</a>; lead on the <a href=\"http://auraphp.com\">Aura</a> and <a href=\"https://github.com/radarphp/Radar.Project\">Radar</a> projects; defined the <a href=\"http://pmjones.io/adr\">Action-Domain-Responder</a> pattern.","twitter_name":"pmjones","avatar_path":"/system/avatars/158/large/IMG_3665-sq.jpg?1432761757"}]},{"id":355,"date":"2015-10-17T15:30:00-04:00","start":"15:30","duration":"01:00","room":"Room 113","title":"TBD3","track":null,"type":"","abstract":"","persons":[]},{"id":356,"date":"2015-10-17T16:30:00-04:00","start":"16:30","duration":"01:00","room":"Room 113","title":"TBD4","track":null,"type":"","abstract":"","persons":[]}],"Room 106":[{"id":264,"date":"2015-10-17T10:00:00-04:00","start":"10:00","duration":"01:00","room":"Room 106","title":"The Problem with UI Components","track":"React.JS (106)","type":"lecture","abstract":"Spaghetti jQuery code, DOM selectors everywhere, and a pyramid of object soup are the best ways to describe Optimizely’s front-end codebase in early 2014.  So we made a decision to refactor from jQuery spaghetti code to UI components and Flux Architecture. But with a new architecture came a new challenge.  This session will present the unique challenges faced with UI components and how we have leverage Flux Architecture and Immutability to solve them!","persons":[{"id":234,"full_public_name":"Jordan Garcia","abstract":"Since founding an instructional gaming website out of his college apartment, Jordan has loved building great experiences on the web.  Currently the Frontend Lead at Optimizely, he's implemented everything from build systems to UI frameworks.  Jordan is also the creator of the first implementation of Flux Architecture to use Immutable data and Functional Reactive Programming, NuclearJS.","twitter_name":"jordanjgarcia","avatar_path":"/system/avatars/234/large/jordan1.jpg?1435685841"}]},{"id":187,"date":"2015-10-17T11:00:00-04:00","start":"11:00","duration":"01:00","room":"Room 106","title":"Moving from Backbone to Backbone + React","track":"React.JS (106)","type":"lecture","abstract":"Come hear a down-to-earth walkthrough of lessons learned from a first-time React.js user who decided to use React to replace his Backbone views and templates.","persons":[{"id":176,"full_public_name":"Micah Wood","abstract":"Micah is a full-stack developer specializing in building websites and applications for enterprises using WordPress. ","twitter_name":"wpscholar","avatar_path":"/system/avatars/176/large/micah.jpg?1439338434"}]},{"id":211,"date":"2015-10-17T13:00:00-04:00","start":"13:00","duration":"01:00","room":"Room 106","title":"Utilizing ES6 in React","track":"React.JS (106)","type":"lecture","abstract":"ECMAScript 6 has been approved, and now we are ready to use it in all things React, or are we?  Let's explore not only what you can and can't do,  but also what you should.","persons":[{"id":200,"full_public_name":"kellyjandrews","abstract":"Principal Developer Evangelist at Syncano, front-end developer, hacker, singer, all-around fun guy.","twitter_name":"kellyjandrews","avatar_path":"/system/avatars/200/large/me-light-small.png?1435233998"}]},{"id":198,"date":"2015-10-17T14:00:00-04:00","start":"14:00","duration":"01:00","room":"Room 106","title":"Controlling Computers IN 3D with React.JS!","track":"React.JS (106)","type":"lecture","abstract":"The trick to building apps that leverage the new LeapMotion Controller is staying responsive in the face of a continuous stream containing tons of data.  I found that ReactJS and Flux are a natural fit to solving for this problem.","persons":[{"id":142,"full_public_name":"Laura Moore","abstract":"Laura Moore's interest in LeapMotion and gesture control in general is fueled by the daily driving challenge to switch between Audible and Waze in Atlanta traffic.","twitter_name":"lk_moore","avatar_path":"/system/avatars/142/large/profiile_facebook.jpg?1435227348"}]},{"id":156,"date":"2015-10-17T15:30:00-04:00","start":"15:30","duration":"01:00","room":"Room 106","title":"Solving the N+1 Problem","track":"PHP (115)","type":"lecture","abstract":"When dealing with databases, developers frequently run into the N+1 problem, in which they populate domain objects via queries in loops. This causes terrible performance drags. There is a solution in plain PHP that makes the number of queries constant to increase performance overall. The talk shows typical PHP code involving the N+1 problem, then shows how to solve the problem in plain PHP (that is, without a framework or ORM), and includes editorializing about the origins of the N+1 problem in the developer mindset.\r\n","persons":[{"id":158,"full_public_name":"Paul M. Jones","abstract":"Internationally-recognized PHP expert; <a href=\"http://php-fig.org\">PHP-FIG</a> founding member; primary author on PSR-1, PSR-2, and PSR-4; author of <a href=\"https://leanpub.com/mlaphp\">Modernizing Legacy Applications in PHP</a>; lead on the <a href=\"http://auraphp.com\">Aura</a> and <a href=\"https://github.com/radarphp/Radar.Project\">Radar</a> projects; defined the <a href=\"http://pmjones.io/adr\">Action-Domain-Responder</a> pattern.","twitter_name":"pmjones","avatar_path":"/system/avatars/158/large/IMG_3665-sq.jpg?1432761757"}]},{"id":357,"date":"2015-10-17T16:30:00-04:00","start":"16:30","duration":"01:00","room":"Room 106","title":"TBD5","track":null,"type":"","abstract":"","persons":[]}],"Room 105":[{"id":309,"date":"2015-10-17T10:00:00-04:00","start":"10:00","duration":"01:00","room":"Room 105","title":"CraftyBits","track":"Server-side JavaScript (105)","type":"lecture","abstract":"The Internet of Things, hand-crafted goods, and cats. Presented by Big Nerd Ranch.","persons":[{"id":24,"full_public_name":"Brandy Porter","abstract":"Director of Design and Instructor at Big Nerd Ranch. ","twitter_name":"@chickerbp","avatar_path":"/system/avatars/24/large/CroppedSmile_BW.jpg?1407169364"},{"id":66,"full_public_name":"Chris Aquino","abstract":"As Director of Front-End Engineering, Chris Aquino leads Big Nerd Ranch’s web team, which specializes in cross-platform app development and training for Open Web technologies. He is also the author and senior instructor of Big Nerd Ranch's \"Cross-Platform JavaScript Apps\" training course. With more than a decade of development experience, his skills and expertise range from Java and Python on the server to all things JavaScript, in the browser and beyond.\r\n\r\nBefore joining Big Nerd Ranch nearly three years ago, Aquino worked as a software engineer for Monumental Interactive. For the last four years, he has volunteered for the Atlanta chapter of the American Institute of Graphic Arts (AIGA) on the sustainability committee. \r\n\r\nAquino graduated from Georgia Tech with a bachelor of science in technology and culture with a focus on computational media and cognitive science.","twitter_name":"@radishmouse","avatar_path":"/system/avatars/66/large/profile_400x400.jpg?1408123964"}]},{"id":366,"date":"2015-10-17T11:00:00-04:00","start":"11:00","duration":"01:00","room":"Room 105","title":"Top 10 Lessons Learned from Enterprise JavaScript Development","track":"Core JavaScript & Frameworks (ABE)","type":"lecture","abstract":"Over the past two decades JavaScript has spread across the Internet, through web browsers, into the enterprise and even onto backend servers through technologies like node.js. Written over just a few short weeks, JavaScript has steadily grown in popularity, matured through various libraries and frameworks, and is now one of the major languages that drives line of business mobile, desktop, and server applications. Programming with JavaScript does not come without costs and tradeoffs, and this talk focuses on lessons learned in the trenches building JavaScript applications with large, globally distributed teams. From frameworks that ease development, libraries that facilitate testing, to languages that improve the development experience, Jeremy Likness shares the tips, tricks, and techniques he has employed over the past 15 years to successfully deliver web-based applications to corporate customers. ","persons":[{"id":295,"full_public_name":"Jeremy Likness","abstract":"Jeremy is the director of application development and principal architect at iVision, a technology services company that leverages data center, converged infrastructure, engineering support services, delivery assurance, and application development practices to engineer the future for clients, today. Jeremy wrote his first program in 1982, was recognized in the \"who's who in Quake\" list for programming the first implementation of \"Midnight Capture the Flag\" in Quake C and has been developing enterprise applications for 20 years. For the past 15 years he has specialized in web-based delivery of line of business applications. Jeremy is the author of four technology books, a six year Microsoft MVP for Windows Platform Development, a Telerik Kendo UI Developer Expert, and speaks and writes regularly on web-based topics such as AngularJS. Jeremy is vegan and spends most of his free time running, hiking and camping with his family, watching retro science fiction movies with his daughter and playing 9-ball and one pocket.","twitter_name":"jeremylikness","avatar_path":"/system/avatars/295/large/jeremy_likness_1024.jpg?1442243464"}]},{"id":369,"date":"2015-10-17T13:00:00-04:00","start":"13:00","duration":"01:00","room":"Room 105","title":"The rise of “API” first applications","track":"Server-side JavaScript (105)","type":"lecture","abstract":"“Mobile first” is no longer good enough.\r\nWith the latest trend of the Internet of Things, there is a major shift occurring in the web development community. Web applications are no longer being built to cater to human interaction, but now must adapt to be able to handle multiple interfaces for machines and humans alike. This new requirement has placed a dramatic emphasis on API interfaces and has ushered in a new development methodology called API­first development. With this new mandate, developers now must concern themselves with their API platform before they build the multitude of disparate applications that depend on it.\r\nThese applications must also be built differently, where status quo techniques are no longer good enough. We are now in a time where the web application server should no longer be responsible for serving application interfaces, but instead must only support external applications through a stateless RESTful API. This method finally releases the application from the confines of the server and allows it to interface to multiple Micro services to become a stand­alone multi­service application.\r\nWith this shift, we have also seen a rise in many different technologies that support this movement. Technologies such as Angular.js and React provide developers a way to create front­end applications that are performant and robust, while on the server side, we have seen a rise of JavaScript based frameworks rooted in the Node.js community that enable web application servers to support a large amount of concurrent applications. Application sessions are also evolving as new token based authentication (JWT) paired with a stateless REST API architecture enables rapid dynamic horizontal scaling. Pair this architecture with containerized deployments with tools such as Docker and you have yourself a trend that isn’t stopping.\r\nIn this presentation, Travis Tidwell, will walk you through the evolution of the web and how we got to where we are today. We will deep dive into the architectures of current technology stacks and discuss why they must adapt to handle the next generation of the web. The following items will be discussed.\r\n● The evolution of the web and where we are today.\r\n● Web 3.0 and what it means to developers\r\n● Why “Mobile First” is no longer good enough.\r\n● API first development\r\n● Multi­service applications on top of Micro­service architectures.\r\n● The rise of Angular.js, React, M.E.A.N stack, and other technologies that support this movement.","persons":[{"id":297,"full_public_name":"Travis Tidwell","abstract":"Travis Tidwell is CTO and Co-founder of <form.io>, the first-to-market combined FORM and API platform; a tool for front-end developers building Web 3.0 and mobile applications.   Travis has been developing advanced enterprise software solutions for over 15 years ranging from Embedded GPS products to Open Source web solutions. In 2008, he co-founded Alethia, a software development shop where he created the popular Open Source multimedia solution MediaFront (http://mediafront.org).  Travis's many Open Source contributions have provided him significant industry recognition, and he has accrued an impressive following within GitHub, YouTube, and Drupal communities. He is typically found giving presentations on Open Source technologies at camps and conferences across the nation.","twitter_name":"softwaregnome","avatar_path":"/system/avatars/297/large/travist.jpg?1444065971"}]},{"id":205,"date":"2015-10-17T14:00:00-04:00","start":"14:00","duration":"01:00","room":"Room 105","title":"Quick and Easy Development with Node.js and Couchbase Server","track":"Server-side JavaScript (105)","type":"lecture","abstract":"Learn how to easily support a flexible data model, designed to scale, using Couchbase Server and the Node.js Couchbase SDK.  Come ready to read code and see some of the great things you can accomplish with Couchbase NoSQL and Node.js.","persons":[{"id":197,"full_public_name":"Nic Raboy","abstract":"Nic is a Developer Advocate for Couchbase in the San Francisco Bay Area.  He has released several native and hybrid mobile applications to iTunes and Google Play and writes about his development experiences related to making web and mobile app development easier to understand.  He has experience in Unity3D, Ionic Framework, Apache Cordova, Java, NoSQL, SQL, PHP, and NodeJS.","twitter_name":"nraboy","avatar_path":"/system/avatars/197/large/1.jpg?1435010473"}]},{"id":246,"date":"2015-10-17T15:30:00-04:00","start":"15:30","duration":"01:00","room":"Room 105","title":"Look Ma, No Server!","track":"Core JavaScript & Frameworks (ABE)","type":"lecture","abstract":"One of the hardest parts of any front end testing strategy is eliminating dependencies; in particular, your own server and data source. This talk will introduce attendees to the problem, why it's important, and how Ajax mocking can make their lives easier. We'll also cover a couple of methods for mocking out server requests using jQuery and Angular. Attendees will leave this session ready to test their front end code without waiting for any back end code to be finished, speeding up development time and reducing headaches!","persons":[{"id":106,"full_public_name":"Jordan Kasper","abstract":"Shortly after it arrived at his home in 1993, Jordan began disassembling his first computer - his mother was not happy. She breathed more easily when he moved from hardware into programming. Jordan's experience includes large companies, startups, and universities. He contributes to a few open source projects and loves participating in user groups, barcamps, and hackathons. Jordan's primary mission is to use JavaScript, HTML, and CSS to elevate web applications above their desktop rivals. He currently works for appendTo, a leader in front-end software solutions. In his down time he enjoys puzzles of all sorts and board games.","twitter_name":"jakerella","avatar_path":"/system/avatars/106/large/jordan_bw.jpg?1437507769"}]},{"id":289,"date":"2015-10-17T16:30:00-04:00","start":"16:30","duration":"01:00","room":"Room 105","title":"Prototyping Wearable Devices Using Javascript","track":"Server-side JavaScript (105)","type":"lecture","abstract":"Prototyping wearable devices used to be something that required specialized skills in electrical engineering, embedded development and mechanical engineering. Today, thanks to the maker revolution,  we can combine our deep knowledge of programming with basic electronics/soldering skills and access to a 3D printer to create useful devices. More importantly, there are now boards that give us as Javascript developers the ability to interact with them without needing to create our own custom Bluetooth Drivers, and writing firmware in C++. \r\n\r\nIn this session, we’ll take a quick tour of some of the options and then do a deep dive into creating a wearable prototype writing only Javascript code using the Metawear board. This will be a hands-on session where we show working demos everything from how to connect with the board, to accessing the onboard sensors and maybe even how to storing data on the device for offline tracking as we build our own running application.","persons":[{"id":78,"full_public_name":"Lance Gleason","abstract":"Lance Gleason has been a computer nut ever since his dad bought him a computer when he was a kid. After nearly a decade as a Java developer for companies like Kodak, CNN, and GE, he decided to end his addiction to heavy inheritance, static typing, and coding without tests. These days, he practices clean Ruby living with lots of well-tested code, class composition, and fun dynamic languages as a developer/startup CTO for hire with extensive experience in data science and committer on open source projects such as the Passbook-iOS, Asari and Active Asari Gems. He is known to practice interspecies pair (purr) programming with his orange tabby, Allie, and when he's not writing code, you will find him diving with sharks, trekking through Chernobyl, sampling wine, cheering on the Springboks or perfecting his biltong recipe.","twitter_name":"lgleasain","avatar_path":"/system/avatars/78/large/cropped__lance_glass_(1).jpg?1439153707"}]}],"Room 104":[{"id":323,"date":"2015-10-17T10:00:00-04:00","start":"10:00","duration":"01:00","room":"Room 104","title":"Responsive Design and Development \"Gotchas\"","track":"Design & UI & UX (104)","type":"lecture","abstract":"This session explores why choosing a good responsive framework, while assisting in development and ensuring a consistent look-and-feel, is just one piece of the much larger process of creating a truly engaging website or web application. Topics include why using the latest swiping motion du jour may not immediately make sense to all users, how a site's layout and content must truly be thought of as an architecture project to get the most \"bang for the buck\", and what problems that interactivity in the form of form entry can result in driving potential users and customers away, never to be seen again. ","persons":[{"id":201,"full_public_name":"Andrew Malek","abstract":"Andrew is a UI developer and occasional designer at NCR, focusing on POS (point-of-sale) and clienteling solutions. He has two decades of development experience in languages such as JavaScript, Visual Basic, Python, and C, and will admit to having developed a content management solution with Delphi and Perl if backed into a corner.","twitter_name":"malekontheweb","avatar_path":"/system/avatars/201/large/Ng6hHpKv_400x400.png?1442337149"}]},{"id":350,"date":"2015-10-17T11:00:00-04:00","start":"11:00","duration":"01:00","room":"Room 104","title":"Execute a non-reactionary UX strategy","track":"Design & UI & UX (104)","type":"lecture","abstract":"Small UX teams have unique challenges, however knowing what those are only part of the battle — how you then deal with having fewer resources and possibly feeling creative isolation, or worse organizational ignorance and/or hostility is the fun part. This workshop will explore some real life team situations that small teams and solo UX practitioners work in, walk you through a UX Strategy blueprint thats small and agile enough to not feel like you're bringing 'process in for process sake', but powerful enough to actually track, measure and learn how to continuing building great products. The goal of this talk is to arm every attendee with better tools and knowledge by creating a personalized plan for their UX practice. This workshop is less about generating design artifacts, and instead focused on ensuring the problems, assumptions and success criteria have been outlined that would then lead feed into how the designs would be created & iterated on.","persons":[{"id":288,"full_public_name":"Vince Baskerville","abstract":"I'm the UX Director at @CallRail, UX Instructor at @_GAAtlanta, an avid member of the tech community, and proud parent with Crystal of our little baby girl.","twitter_name":"whoisvince","avatar_path":"/system/avatars/288/large/vince.jpg?1439995392"}]},{"id":338,"date":"2015-10-17T13:00:00-04:00","start":"13:00","duration":"01:00","room":"Room 104","title":"Responsive Design in the Real World","track":"Design & UI & UX (104)","type":"lecture","abstract":"<p>Making responsive websites is hard. Throw a bunch of opinionated people in the mix and it can feel nearly impossible. Let’s dig into what it takes to handle the pixels and the people really well. From beginning to end, we’ll walk through a solid, designer-focused process to make your next project a success.</p>","persons":[{"id":281,"full_public_name":"Matt D. Smith","abstract":"<p>Matt D. Smith is the owner and Design Director at <a href=\"http://studiomds.co\">Studio Mds</a>, a small independent design studio in Athens, GA.</p> ","twitter_name":"@mds","avatar_path":"/system/avatars/281/large/mds-mug-400.png?1438097185"}]},{"id":326,"date":"2015-10-17T14:00:00-04:00","start":"14:00","duration":"01:00","room":"Room 104","title":"Complex Apps: Designing on a Curve","track":"Design & UI & UX (104)","type":"lecture","abstract":"Power, flexibility, and usability:  where do we draw the lines?  Learn about refining complexity, working with users, when to compromise, and how to effectively design usable, complex, and highly featured interfaces. ","persons":[{"id":39,"full_public_name":"Laurel Lawson","abstract":"","twitter_name":"llcycore","avatar_path":"/system/avatars/39/large/ll.jpg?1439338535"}]},{"id":236,"date":"2015-10-17T15:30:00-04:00","start":"15:30","duration":"00:50","room":"Room 104","title":"Signs of the Times: What road signs taught me about designing for the web","track":"Design & UI & UX (104)","type":"lecture","abstract":"It’s amazing what the physical world can teach us about the digital landscape. Good (and lasting) design is all around us, even in things we take for granted. The classic and ubiquitous design of road signs, for example. This talk draws on the lessons learned during the creation of the road sign system in the 1950s and how those decades-old lessons can be applied to web design in 2015.","persons":[{"id":222,"full_public_name":"Duncan Jimbo","abstract":"Born and raised in Kenya, Duncan Jimbo is a front-end developer living in St. Louis, MO, where he strives daily to make the web a more delightful place to work and play.","twitter_name":"@duncanjimbo","avatar_path":"/system/avatars/222/large/dunca.jpeg?1439338195"}]},{"id":362,"date":"2015-10-17T16:30:00-04:00","start":"16:30","duration":"01:00","room":"Room 104","title":"Gamification vs Motivation in Children's Apps","track":"Design & UI & UX (104)","type":"lecture","abstract":"One of the best ways to keep a mobile app user engaged is through gamification and a well thought-out reward system. Accomplish certain goals, and you'll be rewarded with anything from points to badges to real world goods. But the real satisfaction is through elevating your social status ... be the best amongst your friends!\r\nThis is most certainly true in mobile games. But does it really hold up in the domain of children's games? Perhaps, but not all gamification is created equal when targeting children. The games must be fun, engaging, and keep a child wanting more. But what is the 'more' that you should actually be targeting?","persons":[{"id":75,"full_public_name":"Patrick Seda","abstract":"Patrick is an independent Mobile Application and Solutions Architect. With over 25 years of professional experience, he now orchestrates successful mobile initiatives. Ranging from children’s educational games to enterprise behemoth applications, his focus is delivering bullet-proof, awesomely kickass apps.","twitter_name":"pxtrick","avatar_path":"/system/avatars/75/large/pxtrickAtThatConference_crop.jpg?1431977585"}]}],"Ballroom F":[{"id":176,"date":"2015-10-17T10:00:00-04:00","start":"10:00","duration":"01:00","room":"Ballroom F","title":"Performance Tuning With Firefox Developer Tools","track":"Core JavaScript & Frameworks (ABE)","type":"lecture","abstract":" Mozilla continues to improve Firefox Developer Tools — recently Firefox Developer Edition saw the addition of many new performance-related features to help developers troubleshoot and fix poorly behaving HTML5 apps.  These include new tools for pinpointing frame rate problems, JavasScript bottlenecks, processor-intensive CSS, and memory issues. In this talk the new performance tools will be demonstrated, with practical examples.","persons":[{"id":102,"full_public_name":"Jason Weathersby","abstract":"Jason Weathersby is a Technical Evangelist for Mozilla, evangelizing Firefox OS. He is also a committer on the BIRT project at the Eclipse Foundation, and has co-authored several books and written many articles on BIRT integration. He is a proponent of HTML5, the Open Web and Open Source and is a regular contributor to the Mozilla Hacks blog.  Jason has over 20 years experience in the software development field, ranging from real time process control to business intelligence software. ","twitter_name":"jasonweathersby","avatar_path":"/system/avatars/102/large/JasonWeathersby380.JPG?1408657220"}]},{"id":142,"date":"2015-10-17T11:00:00-04:00","start":"11:00","duration":"01:00","room":"Ballroom F","title":"Let's turn real User Data into a Science","track":"Server-side JavaScript (105)","type":"workshop","abstract":"This session will delve deep into the technical trade-offs and selection process involved in choosing the underlying architecture for the data warehouse that is to contain the real user beacon data that is collected from web & mobile users by the billions every second of every day.  This beacon data can then be used for marketing campaigns, performance enhancements and any other types of data analysis required by a business to use the information to increase bottom line revenue.","persons":[{"id":152,"full_public_name":"Dan Boutin","abstract":"Based in Gainesville, Florida, Mr. Daniel Boutin is Senior Product Evangelist at SOASTA.  ","twitter_name":"DanBoutinSOASTA","avatar_path":"/system/avatars/152/large/Dan-March-8-2015.jpg?1439245079"}]},{"id":160,"date":"2015-10-17T13:00:00-04:00","start":"13:00","duration":"01:00","room":"Ballroom F","title":"You Won’t Believe This One Weird Way to Rewrite Closures","track":"Core JavaScript & Frameworks (ABE)","type":"lecture","abstract":"Closures are undoubtedly the most powerful feature JavaScript inherited from its Lisp forbears. But would JS be so powerful… without them?\r\n\r\nWe’ll <strong>reimplement closures entirely from scratch</strong> without the convenience of native local variables or function parameters. Entirely in JavaScript. Using <strong>prototypal inheritance,</strong> some clever <strong>hat-tips from graphics programming,</strong> amnesic <strong>function bodies,</strong> and this <strong>one weird global variable.</strong>","persons":[{"id":72,"full_public_name":"Jonathan Martin","abstract":"Jonathan is a Developer & Instructor at Big Nerd Ranch, where he sheds bikes in Rails (i.e. meticulous code architecture), or bores students with the “wats” of JavaScript in the Ranch’s immersive front-end bootcamp.","twitter_name":"nybblr","avatar_path":"/system/avatars/72/large/avatar.png?1408041461"}]},{"id":238,"date":"2015-10-17T14:00:00-04:00","start":"14:00","duration":"01:00","room":"Ballroom F","title":"Prototyping and DIY Electronics with JavaScript","track":"Server-side JavaScript (105)","type":"lecture","abstract":"Come learn about the state of the art when it comes to electronics and Internet of Things prototyping with JavaScript. We will talk about Arduino, Raspberry Pi, Espruino, Johnny Five, and all the various ways you can get started with making your own custom electronic widgets.","persons":[{"id":90,"full_public_name":"Micah Wedemeyer","abstract":"Micah is a consultant and partner in The Agile League, a web development and design agency based in Atlanta, Georgia. He loves combining entrepreneurship with hacking, design and practical product management. He also built and runs Obsidian Portal, sort of a “basecamp for Dungeons and Dragons”.\r\n \r\nWhen he’s not working on projects for The Agile League, Micah is practicing stunt kiting, skateboarding, kayaking, mountain biking, and co-hosting a weekly Dungeons and Dragons podcast, Haste.","twitter_name":"@micahwedemeyer","avatar_path":"/system/avatars/90/large/micah_wedemeyer_headshot.jpg?1408421883"}]},{"id":214,"date":"2015-10-17T15:30:00-04:00","start":"15:30","duration":"01:00","room":"Ballroom F","title":"Owning Web Performance with PhantomJS 2","track":"Core JavaScript & Frameworks (ABE)","type":"lecture","abstract":"Navigation Timing APIs, available in most web browsers, give developers a way to measure and visualize web performance at a very fine grained level. This data can be used to drive business level decisions on user experience and overall web best practices. This talk will equip attendees with the knowledge and tools to measure web performance and automate the process with a single PhantomJS 2 JavaScript file.","persons":[{"id":82,"full_public_name":"Wesley Hales","abstract":"Wesley Hales is an author, occasional speaker and Lead Software Developer at Shape Security.\r\n\r\nIn his spare time, Wesley works on onslyde and loadreport.js.\r\nYou can read his <a href=\"http://wesleyhales.com\">articles</a>, or follow him on twitter <a href=\"http://twitter.com/wesleyhales\">@wesleyhales</a>.","twitter_name":"wesleyhales","avatar_path":"/system/avatars/82/large/velocityspeakers-029-square.png?1408373201"}]},{"id":329,"date":"2015-10-17T16:30:00-04:00","start":"16:30","duration":"01:00","room":"Ballroom F","title":"CI and Deployment with Full Stack JS and Hybrid Mobile","track":"Core JavaScript & Frameworks (ABE)","type":"lecture","abstract":"Setting up a Continuous Integration and Continuous Deployment system for a JavaScript project can be tedious and frustrating. You want this system to work for you, not the other way around. With this talk you will be able to do just that.","persons":[{"id":173,"full_public_name":"Bryan Oliver","abstract":"<h1> JavaScript and C Programming Nut </h1>\r\n<p> I am the founder and head of Whitehall Technologies (proprietary and open source software development), as well as Whitehall Studios (agency). I am also the founder and maintainer of the Atlanta Ionic Developers group. </p>","twitter_name":"kin3tics","avatar_path":"/system/avatars/173/large/pic.jpeg?1436723051"}]}],"Ballroom D":[{"id":348,"date":"2015-10-17T10:00:00-04:00","start":"10:00","duration":"00:40","room":"Ballroom D","title":"State of Titanium","track":"Mobile (C)","type":"lecture","abstract":"There's been a lot going on with the Titanium SDK this year.  Come find out about improvements to Titanium and all the new features available.","persons":[{"id":285,"full_public_name":"Rick Blalock","abstract":"I am a mobile first technologist that's worked with some amazing people. As a native Floridian, I started my first consulting company in Jupiter, FL. Throughout the years I've been a part of big technology shifts in the CMS industry, mobile industry, and more.","twitter_name":"rblalock","avatar_path":"/system/avatars/285/large/IMG_7758_1.jpeg?1439340589"}]},{"id":141,"date":"2015-10-17T11:00:00-04:00","start":"11:00","duration":"01:00","room":"Ballroom D","title":"UX super powers with Project Comet","track":"Mobile (C)","type":"lecture","abstract":"What is UX? Is it important? Is it really a thing? If it is, how can you become better at it? In this talk, Demian will take you on a journey from key principles of User Experience Design for Mobile and Web, covering which hats to wear and why empathy plus learning is key for crafting amazing interfaces that will lead to conversion and success. Be one of the first people on the planet to see Project Comet, a brand new tool from Adobe, tailored to UX Design focused on Mobile Apps and Web Sites, enabling UX Designers to design and prototype  at speed of thought.","persons":[{"id":151,"full_public_name":"Demian Borba","abstract":"Demian is a Product Manager for Project Comet at Adobe San Francisco, with more than 16 years of experience with technology, interactive media, design, business, community engagement and training. Before Adobe, he worked as a Developer Advocate, first for BlackBerry and then Braintree/PayPal, traveling the world to engage with developers and startups. He also ran Action Creations, an interactive agency based in San Diego, designing and developing apps for clients including Oakley, 20th Century Fox, World Surf League, Nike and many more. Demian is committed to the growth of new innovators, has taught design and programming at UCSD, as well as his own training programs focused on Design Thinking and mobile development, reaching hundreds of developers, designers and entrepreneurs. Learning, empathy, innovation and technology drive his work and his personal life.","twitter_name":"demianborba","avatar_path":"/system/avatars/151/large/demian-2011-white-background-edited.jpg?1432473152"}]},{"id":240,"date":"2015-10-17T13:00:00-04:00","start":"13:00","duration":"01:00","room":"Ballroom D","title":"Test-Driving Through the Swamp: TDD-ing WebViews on a Hybrid App","track":"Mobile (C)","type":"lecture","abstract":"One day you discover WebViews are a thing that make cross-platform development possible. OMG YAY - develop once, ship everywhere. Then because you’re a good coder, you’re going to test drive your development all the way through. . You start setting things up… and then find yourself absolutely mired in emulation mud. Welcome to the swamp that is TDD-ing WebViews on a Hybrid App. Never fear though because together we can navigate out of this swamp, and turn it into a beautiful garden of TDD-ness.","persons":[{"id":193,"full_public_name":"Laura Ku","abstract":"","twitter_name":"pku2319","avatar_path":"/system/avatars/193/large/laura.jpg?1439338818"}]},{"id":131,"date":"2015-10-17T14:00:00-04:00","start":"14:00","duration":"01:00","room":"Ballroom D","title":"10 Tips for Kickass Enterprise Mobile Apps","track":"Mobile (C)","type":"lecture","abstract":"The current speed of Mobile app development is fast and furious. Development shops are happy to crank out apps at this pace, but in the Enterprise world, the unfortunate carnage is an embarrassing product and a mess of crappy unmaintainable code. This talk will guide you towards quality and usability, and ultimately show you the steps to produce your most excellent kickass apps! Awesomeness will prevail!","persons":[{"id":75,"full_public_name":"Patrick Seda","abstract":"Patrick is an independent Mobile Application and Solutions Architect. With over 25 years of professional experience, he now orchestrates successful mobile initiatives. Ranging from children’s educational games to enterprise behemoth applications, his focus is delivering bullet-proof, awesomely kickass apps.","twitter_name":"pxtrick","avatar_path":"/system/avatars/75/large/pxtrickAtThatConference_crop.jpg?1431977585"}]},{"id":174,"date":"2015-10-17T15:30:00-04:00","start":"15:30","duration":"01:00","room":"Ballroom D","title":"Developing for offline Mobile experiences","track":"Mobile (C)","type":"lecture","abstract":"What happens when your mobile device does not have a network connection?  That device will have no content, no experience and the amazing application that you spent so much effort to build just simply will not work.  \r\n\r\nThis talk would be around the implementation story of creating offline and online applications on Mobile.  With offline mobile apps, you are able to have a full experience without relying on network connectivity.  ","persons":[{"id":197,"full_public_name":"Nic Raboy","abstract":"Nic is a Developer Advocate for Couchbase in the San Francisco Bay Area.  He has released several native and hybrid mobile applications to iTunes and Google Play and writes about his development experiences related to making web and mobile app development easier to understand.  He has experience in Unity3D, Ionic Framework, Apache Cordova, Java, NoSQL, SQL, PHP, and NodeJS.","twitter_name":"nraboy","avatar_path":"/system/avatars/197/large/1.jpg?1435010473"}]},{"id":239,"date":"2015-10-17T16:30:00-04:00","start":"16:30","duration":"01:00","room":"Ballroom D","title":"Ionic +AngularJS +PhoneGap Build","track":"Mobile (C)","type":"workshop","abstract":"A Simple Introduction into Hybrid Mobile App Development\r\n\r\nUsing Ionic, AngularJS, PhoneGap Build ","persons":[{"id":224,"full_public_name":"Eric DeCoff","abstract":"Just another mobile developer with back-end experience","twitter_name":"@EricDeCoff","avatar_path":"/system/avatars/224/large/t-shirt-nerd-inside.jpg?1435636067"}]}],"Ballroom C":[{"id":275,"date":"2015-10-17T10:00:00-04:00","start":"10:00","duration":"00:50","room":"Ballroom C","title":"Modern and Secure PHP","track":"PHP (115)","type":"lecture","abstract":"This is not the PHP of old. Learn what's changed in the PHP world over the last few years. Classes, objects, statics, traits, unit testing, composer, password hashing; it's a whole new ballgame.\r\n\r\nLearn what has changed in the PHP world over the last several years. We'll cover \r\nThe newest PHP language features. \r\nCommunity efforts such as the PHP Framework Interoperability Group, Composer, and PHP the Right Way. \r\nHow to secure your application using up to date techniques.","persons":[{"id":238,"full_public_name":"Ben Edmunds","abstract":"CTO of an awesome company you've never heard of by day, hacking on crazy ideas by night. PHP Town Hall podcast co-host. CodeIgniter Steering Committee member. Author. Speaker. Open Source Advocate.","twitter_name":"benedmunds","avatar_path":"/system/avatars/238/large/ben_newProfilePic.jpg?1435695408"}]},{"id":296,"date":"2015-10-17T11:00:00-04:00","start":"11:00","duration":"01:00","room":"Ballroom C","title":"Content-Security-Policy in the wild","track":"Web/HTML/CSS (D)","type":"lecture","abstract":"Cross Site Scripting - or short XSS - is a security vulnerability as old as the web. Despite continuous efforts to educate developers to properly escape values before outputting though XSS are still a common problem. To mitigate XSS attacks at the browser level the Content Security Policy (CSP) have been developed.","persons":[{"id":246,"full_public_name":"Arne Blankerts","abstract":"Arne Blankerts designs reliable infrastructures and relentlessly eliminates security holes. ","twitter_name":"arneblankerts","avatar_path":"/system/avatars/246/large/arne.jpg?1438984949"}]},{"id":317,"date":"2015-10-17T13:00:00-04:00","start":"13:00","duration":"01:00","room":"Ballroom C","title":"PHP at Google Scale","track":"PHP (115)","type":"lecture","abstract":"Google's infrastructure powers our crazy ideas, like Gmail, Google Maps, or Android. The same infrastructure that powers us can power you on Google Cloud Platform. However, the different ways that you can host your PHP apps on Google Cloud Platform can be daunting. This session will show you the commands and code to get your crazy idea running next to ours. ","persons":[{"id":259,"full_public_name":"Terry Ryan","abstract":"Terry Ryan is a Developer Advocate for the Google Cloud Platform team. He has 15 years of experience working with the web - both front end and back. He is passionate about web standards and wants to bring web developers to the Google Cloud Platform. Before Google, he worked for Adobe and the Wharton School of Business. \r\n","twitter_name":"tpryan","avatar_path":"/system/avatars/259/large/2015-terry-ryan.jpg?1436226310"}]},{"id":172,"date":"2015-10-17T14:00:00-04:00","start":"14:00","duration":"01:00","room":"Ballroom C","title":"Database Basics with PHP","track":"PHP (115)","type":"lecture","abstract":"Databases are often difficult for developers as they are trying to use a Descriptive Language (SQL) with a procedural or object orientated language.  This session will cover the basics of SQL design, thinking in sets (avoid N+1 problems), and code for using databases.","persons":[{"id":155,"full_public_name":"Dave Stokes","abstract":"Dave Stokes is a MySQL Community Manager for Oracle.  Previously he was the MySQL Certification Manager for MySQL AB and SUN.  He has worked for companies ranging alphabetically from the American Heart Association to Xerox and work ranging from Anti-submarine warfare to web developer.  And he really wonders how many people really, really read these conference biographies.","twitter_name":"Stoker","avatar_path":"/system/avatars/155/large/davestokes.jpg?1432735988"}]},{"id":259,"date":"2015-10-17T15:30:00-04:00","start":"15:30","duration":"01:00","room":"Ballroom C","title":"PHP for Embedded Devices","track":"PHP (115)","type":"lecture","abstract":"This talk will look into how one can get started in building  php applications that run them on devices like the raspberry PI and Arduino among others.","persons":[{"id":214,"full_public_name":"Mose Ngone","abstract":"Software Engineer at  BRCK","twitter_name":"mospired","avatar_path":"/system/avatars/214/large/bio-pic.png?1439305793"}]},{"id":303,"date":"2015-10-17T16:30:00-04:00","start":"16:30","duration":"01:00","room":"Ballroom C","title":"Practical Computer Science Concepts Simplified","track":"PHP (115)","type":"lecture","abstract":"","persons":[{"id":249,"full_public_name":"Joshua Silver","abstract":"Joshua Silver is VP, Product Development and the technical co-founder of Patientco, a healthcare IT and payments startup in Atlanta. At Patientco, he is responsible for overall product direction, R&D initiatives, and technology strategy. Joshua has over a decade of development (mostly PHP/MySQL) and product management experience and frequently speaks on topics such as consumer-centric system design, secure payment processing, and scalable web architecture. Joshua holds a BS in Computer Science from GA Tech. When not working, Joshua is most likely traveling and has been to nearly 30 countries.","twitter_name":"1yellowbrick","avatar_path":"/system/avatars/249/large/joshua_silver_headshot_2.jpg?1439393630"}]}],"Ballroom ABE":[{"id":307,"date":"2015-10-17T09:00:00-04:00","start":"09:00","duration":"01:00","room":"Ballroom ABE","title":"Stronger Than Fear: Mental Health in the Developer Community (Ballroom ABE)","track":"Keynote","type":"lecture","abstract":"Mental disorders are the largest contributor to disease burden in North America, but the developer community and those who employ us are afraid to face the problem head-on. In this talk, we'll examine the state of mental health awareness in the developer workplace, why most developers feel it isn't safe to talk about mental health, and what we can do to change the culture and save lives. Attendees will leave with 5 things they can do to make their workplace safer for those dealing with mental health disorders.","persons":[{"id":253,"full_public_name":"Ed Finkler","abstract":"Long time web developer, advocating for mental health awareness and support in the tech community.","twitter_name":"funkatron","avatar_path":"/system/avatars/253/large/ed_finkler_square.jpg?1438629336"}]},{"id":149,"date":"2015-10-17T10:00:00-04:00","start":"10:00","duration":"01:00","room":"Ballroom ABE","title":"TDD with TypeScript, AngularJS and Node.js","track":"Core JavaScript & Frameworks (ABE)","type":"lecture","abstract":"Let’s take a look how we can use TDD for building web applications with TypeScript on the client side (with AngularJS) and server side (with NodeJS).","persons":[{"id":159,"full_public_name":"Jakub Jedryszek","abstract":"Jakub Jedryszek works for Microsoft as Software Engineer. Currently he is working on <a href=\"http://portal.azure.com\">the Azure Portal</a> – the largest and most complex Single Page Web Application in the World written in TypeScript. He is a founder of <a href=\"http://dotnetconf.pl\">dotNetConfPL</a> – online conference for .NET Developers. His blog is at <a href=\"http://jj09.net\">jj09.net</a>.","twitter_name":"JakubJedryszek","avatar_path":"/system/avatars/159/large/299ad37f586aa79c7e0839fd4a18509a.jpeg?1441225536"}]},{"id":331,"date":"2015-10-17T11:00:00-04:00","start":"11:00","duration":"01:00","room":"Ballroom ABE","title":"Introducing Trix","track":"Core JavaScript & Frameworks (ABE)","type":"lecture","abstract":"Javan Makhmali and Sam Stephenson will unveil Trix, the rich text editing system featured in the next generation of Basecamp. An open-source release will immediately follow the presentation.","persons":[{"id":286,"full_public_name":"Javan Makhmali","abstract":"Javan is a programmer at <a href=\"https://basecamp.com/\">Basecamp</a> where he's worked happily for the last five years (that's 30 years in tech years). He actively maintains and contributes to many <a href=\"https://github.com/javan?tab=activity\">open-source projects</a>.","twitter_name":"javan","avatar_path":"/system/avatars/286/large/javan_bw_square.jpg?1439580150"},{"id":271,"full_public_name":"Sam Stephenson","abstract":"Sam has worked as a programmer for <a href=\"https://basecamp.com/\">Basecamp</a> since 2005, and has created and contributed to a number of open-source projects, including <a href=\"http://rubyonrails.org/\">Ruby on Rails</a>, <a href=\"http://coffeescript.org/\">CoffeeScript</a>, and <a href=\"http://pow.cx/\">Pow</a>.","twitter_name":"sstephenson","avatar_path":"/system/avatars/271/large/VySz8SQS.png?1436851647"}]},{"id":222,"date":"2015-10-17T13:00:00-04:00","start":"13:00","duration":"01:00","room":"Ballroom ABE","title":"How to Learn","track":"Core JavaScript & Frameworks (ABE)","type":"lecture","abstract":"In the software profession, learning is an integral part of our job. I will describe a few techniques - which, taken together, comprise a loose framework for learning any new complex piece of technology, whether it be a new framework, library, platform, or programming language - using resources you can readily find on the internet.","persons":[{"id":12,"full_public_name":"Toby Ho","abstract":"Toby Ho is a veteran JavaScript developer in Atlanta. He blogs at tobyho.com and is passionate about helping others learn. He is active in the open source community where his proudest work is Test’em - a Javascript test runner.","twitter_name":"airportyh","avatar_path":"/system/avatars/12/large/avatar.jpg?1408126251"}]},{"id":333,"date":"2015-10-17T14:00:00-04:00","start":"14:00","duration":"01:00","room":"Ballroom ABE","title":"The Art and Science of Suspending Execution","track":"Core JavaScript & Frameworks (ABE)","type":"lecture","abstract":"Coroutines, Goroutines, Fibers, Generators, and Continuations are all different ways to suspend the execution of functions in programs. Since we're very close to getting async/await in JavaScript -- it's time to buckle down to understand what's the big idea behind suspending execution, the different implementations, and their applicability in the Web and JavaScript.","persons":[{"id":273,"full_public_name":"Amjad Masad","abstract":"JavaScript Infrastructure Engineer at Facebook","twitter_name":"amasad","avatar_path":"/system/avatars/273/large/amjad.jpeg?1439330733"}]},{"id":286,"date":"2015-10-17T15:30:00-04:00","start":"15:30","duration":"01:00","room":"Ballroom ABE","title":"On beyond Testing","track":"Server-side JavaScript (105)","type":"lecture","abstract":"This session is for JavaScript developers. In it, you'll learn how to use and abuse your TDD framework to improve the design of your application, modules, and functions.","persons":[{"id":233,"full_public_name":"Burk Hufnagel","abstract":"Burk is a long-time programmer and software architect, with experience in multiple languages including Java and JavaScript. He’s presented at multiple conferences including DevNexus and JavaOne, and contributed to two of the “97 Things” books published by O’Reilly. He works as an  Application Architect for Daugherty Business Solutions where he spends a lot of time writing JavaScript for a rather large project, and looking for ways to improve his skills and the skills of his team.","twitter_name":"@BurkHufnagel","avatar_path":"/system/avatars/233/large/Burk_120x150.jpg?1435685376"}]},{"id":352,"date":"2015-10-17T16:30:00-04:00","start":"16:30","duration":"01:00","room":"Ballroom ABE","title":"JavaScript Software Craftsmanship","track":"Core JavaScript & Frameworks (ABE)","type":"lecture","abstract":"Becoming an expert coder involves much more than learning the coolest new framework or becoming a design pattern ninja.  Becoming an expert coder is about passion and craftsmanship.\r\n","persons":[{"id":291,"full_public_name":"Stephen M. Carlson","abstract":"Full-stack Software Engineer obsessed with writing high quality, maintainable and extensible code. Agile evangelist, technology leader and entrepreneur.","twitter_name":"xiinteractiv","avatar_path":"/system/avatars/291/large/IMG_0332_cropped.jpg?1440557507"}]},{"id":361,"date":"2015-10-17T17:30:00-04:00","start":"17:30","duration":"00:30","room":"Ballroom ABE","title":"Closing & Prize Giveaways!","track":"Admin","type":"","abstract":"Prize giveaways!","persons":[{"id":7,"full_public_name":"Pratik Patel","abstract":"Pratik Patel is the CTO of Atlanta based startup TripLingo. He’s also an author, speaker, and consultant helping technologists build great apps, and business people make the most of technology. After many years in the big corporate world in places such as New York, London and Hong Long, he’s in the startup space now and hacks iOS, Android, Java, HTML5, CSS3, JavaScript, Rails, and ..... well everything except Perl. You can follow him on twitter at @prpatel.","twitter_name":"prpatel","avatar_path":"/system/avatars/7/large/profile-pic-09-11-2011.jpg?1406354223"}]}],"Foyer":[{"id":360,"date":"2015-10-17T12:00:00-04:00","start":"12:00","duration":"01:00","room":"Foyer","title":"Lunch Day 2","track":null,"type":"","abstract":"","persons":[]},{"id":273,"date":"2015-10-17T15:00:00-04:00","start":"15:00","duration":"01:00","room":"Foyer","title":"Afternoon Break 2","track":"Admin","type":"other","abstract":"","persons":[{"id":7,"full_public_name":"Pratik Patel","abstract":"Pratik Patel is the CTO of Atlanta based startup TripLingo. He’s also an author, speaker, and consultant helping technologists build great apps, and business people make the most of technology. After many years in the big corporate world in places such as New York, London and Hong Long, he’s in the startup space now and hacks iOS, Android, Java, HTML5, CSS3, JavaScript, Rails, and ..... well everything except Perl. You can follow him on twitter at @prpatel.","twitter_name":"prpatel","avatar_path":"/system/avatars/7/large/profile-pic-09-11-2011.jpg?1406354223"}]},{"id":272,"date":"2015-10-17T19:00:00-04:00","start":"19:00","duration":"00:10","room":"Foyer","title":"After Party: Downtown ATL!","track":"Admin","type":"other","abstract":"For our closing after party, we'll be heading to a swanky location in downtown Atlanta. Come join us as we close down the conference in style!","persons":[{"id":7,"full_public_name":"Pratik Patel","abstract":"Pratik Patel is the CTO of Atlanta based startup TripLingo. He’s also an author, speaker, and consultant helping technologists build great apps, and business people make the most of technology. After many years in the big corporate world in places such as New York, London and Hong Long, he’s in the startup space now and hacks iOS, Android, Java, HTML5, CSS3, JavaScript, Rails, and ..... well everything except Perl. You can follow him on twitter at @prpatel.","twitter_name":"prpatel","avatar_path":"/system/avatars/7/large/profile-pic-09-11-2011.jpg?1406354223"}]}]}}]}}}